{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "91390881-5653-4050-b39a-3256c9314557",
   "metadata": {},
   "source": [
    "# Load the CSV file\n",
    "\n",
    "In this module, you will learn about:\n",
    "- Creating nodes and relationships with data from a CSV file\n",
    "- Assigning properties to nodes and relationships\n",
    "- The importance of unique identifiers and how to create constraints\n",
    "\n",
    "You will load a CSV file of \"person\" data into Person nodes in Neo4j. The CSV file contains the following fields:\n",
    "\n",
    "- person_tmdbId\n",
    "- bio\n",
    "- born\n",
    "- bornIn\n",
    "- died\n",
    "- person_imdb\n",
    "- Id\n",
    "- name\n",
    "- person_poster\n",
    "- person_url\n",
    "\n",
    "Download the [persons.csv](https://data.neo4j.com/importing-cypher/persons.csv?_gl=1*15dcbv9*_ga*MTkzMzgxNTk1LjE3NTcyNTg0MzQ.*_ga_DZP8Z65KK4*czE3NjI2NDg5NzIkbzMyJGcxJHQxNzYyNjQ5NTA0JGoyMyRsMCRoMA..*_gcl_au*MjEzNTI4NjkxNy4xNzU3MjU4NDMzLjc4MDQ1OTczLjE3NTg0MTY3NjUuMTc1ODQxNjc2NA..*_ga_DL38Q8KGQC*czE3NjI2NDg5NzIkbzMyJGcxJHQxNzYyNjQ5NTA0JGoyMyRsMCRoMA..) file"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "3b5318a2-e797-43e8-aba0-ae440626ff14",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j._sync.work.result.Result object at 0x7f48789ce6f0>\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "load_dotenv()\n",
    "\n",
    "import textwrap\n",
    "from neo4j import GraphDatabase\n",
    "from utils import execute_query\n",
    "\n",
    "\n",
    "neo4j_uri = os.getenv(\"NEO4J_URI\")\n",
    "neo4j_user = os.getenv(\"NEO4J_USERNAME\")\n",
    "neo4j_pass = os.getenv(\"NEO4J_PASSWORD\")\n",
    "neo4j_db = os.getenv(\"NEO4J_DATABASE\")\n",
    "\n",
    "\n",
    "neo4j_driver = GraphDatabase.driver(neo4j_uri,\n",
    "                                   auth=(neo4j_user,neo4j_pass))\n",
    "\n",
    "\n",
    "cypher = textwrap.dedent(\"\"\"\n",
    "LOAD CSV WITH HEADERS\n",
    "FROM 'https://data.neo4j.com/importing-cypher/persons.csv' AS row\n",
    "RETURN row\n",
    "\"\"\")\n",
    "\n",
    "res = execute_query(neo4j_driver, cypher)\n",
    "\n",
    "print(res)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "abdce3c6-bbc1-4697-b995-3e26b0a25f8d",
   "metadata": {},
   "source": [
    "# Create Person nodes\n",
    "\n",
    "Run the Cypher statement to create the Person nodes:\n",
    "\n",
    "```cypher\n",
    "LOAD CSV WITH HEADERS\n",
    "FROM 'https://data.neo4j.com/importing-cypher/persons.csv' AS row\n",
    "MERGE (p:Person {tmdbId: toInteger(row.person_tmdbId)})\n",
    "SET\n",
    "p.imdbId = toInteger(row.person_imdbId),\n",
    "p.bornIn = row.bornIn,\n",
    "p.name = row.name,\n",
    "p.bio = row.bio,\n",
    "p.poster = row.poster,\n",
    "p.url = row.url,\n",
    "p.born = row.born,\n",
    "p.died = row.died\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "fc6f0fab-bd26-4ac8-a18d-41e854049b8c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j._sync.work.result.Result object at 0x7f4877fa0dd0>\n"
     ]
    }
   ],
   "source": [
    "cypher = textwrap.dedent(\"\"\"\n",
    "LOAD CSV WITH HEADERS\n",
    "FROM 'https://data.neo4j.com/importing-cypher/persons.csv' AS row\n",
    "MERGE (p:Person {tmdbId: toInteger(row.person_tmdbId)})\n",
    "SET\n",
    "p.imdbId = toInteger(row.person_imdbId),\n",
    "p.bornIn = row.bornIn,\n",
    "p.name = row.name,\n",
    "p.bio = row.bio,\n",
    "p.poster = row.poster,\n",
    "p.url = row.url,\n",
    "p.born = row.born,\n",
    "p.died = row.died\n",
    "\"\"\")\n",
    "\n",
    "res = execute_query(neo4j_driver, cypher)\n",
    "\n",
    "print(res)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "12c9bcd1-324b-4a31-893e-2d3562c86156",
   "metadata": {},
   "source": [
    "Confirm the data is in the graph by returning the first 25 Person nodes:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "d2add20d-11c1-4bcf-88b1-f2b190d346e6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j._sync.work.result.Result object at 0x7f4877fa1790>\n"
     ]
    }
   ],
   "source": [
    "cypher = textwrap.dedent(\"\"\"\n",
    "MATCH (p:Person) RETURN p LIMIT 25\n",
    "\"\"\")\n",
    "\n",
    "res = execute_query(neo4j_driver, cypher)\n",
    "\n",
    "print(res)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dabc84c8-9dc0-4361-a391-b9c367b56e32",
   "metadata": {},
   "source": [
    "# Unique IDs and Constraints\n",
    "\n",
    "\n",
    "\n",
    "A Neo4j best practice is to use an ID as a unique property value for each node.\n",
    "\n",
    "Unique IDs help ensure duplicate data is not created. When you load data from CSV files, you rely heavily upon the IDs specified in the file. If the IDs in your CSV file are not unique for the same entity (node), you could create duplicate data. You may also have problems loading the data and creating relationships between nodes.\n",
    "\n",
    "You can add constraints to your database to stop the creation of nodes with duplicate IDs.\n",
    "\n",
    "## Create a unique constraint\n",
    "\n",
    "The syntax for creating a unique constraint on a property is:\n",
    "\n",
    "```cypher\n",
    "CREATE CONSTRAINT [constraint_name] [IF NOT EXISTS]\n",
    "FOR (n:LabelName)\n",
    "REQUIRE n.propertyName IS UNIQUE\n",
    "```\n",
    "\n",
    "The constraint is for a property on all nodes with a specified label.\n",
    "\n",
    "The `constraint_name` is optional, but it is good practice to specify one. If you do not specify a constraint name, Neo4j will create one for you.\n",
    "\n",
    "The `IF NOT EXISTS` clause is also optional - if not used Neo4j will generate an error if the constraint already exists.\n",
    "\n",
    "## Person node constraint\n",
    "\n",
    "The Person nodes you created should all have a unique tmbdId property.\n",
    "\n",
    "You can create a constraint for the tmdbId property to ensure that all Person nodes have a unique `tmdbId` property value.\n",
    "\n",
    "Review the following Cypher statement.\n",
    "```cypher\n",
    "CREATE CONSTRAINT Person_tmdbId IF NOT EXISTS\n",
    "FOR (x:Person)\n",
    "REQUIRE x.tmdbId IS UNIQUE\n",
    "```\n",
    "\n",
    "- The constraint name is Person_tmdbId.\n",
    "\n",
    "- The optional clause IF NOT EXISTS is used - without which Neo4j would raise an error if the constraint exists.\n",
    "\n",
    "- It applies to all nodes with the Person label.\n",
    "\n",
    "- It requires the tmdbId property to be unique.\n",
    "\n",
    "\n",
    "If you try to create a Person node with a duplicate tmdbId property value, Neo4j will raise an error.\n",
    "\n",
    "```cypher\n",
    "CREATE (p:Person {tmdbId: 3}) RETURN p\n",
    "```\n",
    "\n",
    "=>\n",
    "\n",
    "```\n",
    "22N80: Data exception - index entry conflict\n",
    "Index entry conflict: Node(0) already exists with label `Label[0]` and property `PropertyKey[10]` = 3.\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "65e6eae0-996d-41cc-9aa0-d7a13ce7ef02",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "a9ceb781-bf51-43f1-b8fe-ae1c5faf011a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j._sync.work.result.Result object at 0x7f4877fbc7d0>\n"
     ]
    }
   ],
   "source": [
    "cypher = textwrap.dedent(\"\"\"\n",
    "CREATE CONSTRAINT Person_tmdbId\n",
    "FOR (x:Person)\n",
    "REQUIRE x.tmdbId IS UNIQUE\n",
    "\"\"\")\n",
    "\n",
    "res = execute_query(neo4j_driver, cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "85594e49-8cc5-4e76-9f1d-46a7426a6b59",
   "metadata": {},
   "source": [
    "### Show constraint\n",
    "\n",
    "You can check that the constraint has been created by running the following Cypher statement:\n",
    "\n",
    "```cypher\n",
    "SHOW CONSTRAINTS\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "b2a8019c-274a-4481-9ea9-951dedf6eebd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f48761dfad0>"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = textwrap.dedent(\"\"\"\n",
    "SHOW CONSTRAINTS\n",
    "\"\"\")\n",
    "\n",
    "res = execute_query(neo4j_driver, cypher)\n",
    "\n",
    "res"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fd022ef8-3873-4862-9ef1-bb700f082f33",
   "metadata": {},
   "source": [
    "### Drop constaint\n",
    "If you need to drop a constraint, use the following Cypher statement.\n",
    "\n",
    "```cypher\n",
    "DROP CONSTRAINT [constraint_name]\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "88a8c9e1-befe-4ea9-a0bf-b23463843a2d",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
