{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "4d824d1b-1f92-476a-b083-e08247a06ecf",
   "metadata": {},
   "source": [
    "# Kuzu\n",
    "\n",
    "Welcome to the Kuzu docs!\n",
    "\n",
    "Kuzu is an embedded graph database built for query speed and scalability. It is optimized for handling complex join-heavy analytical workloads on very large graphs and has the following core features:\n",
    "\n",
    "- Property Graph data model and Cypher query language\n",
    "- Embedded (in-process) integration with applications\n",
    "- Columnar disk-based storage\n",
    "- Columnar and compressed sparse row-based (CSR) adjacency list and join indices\n",
    "- Vectorized and factorized query processing\n",
    "- Novel and efficient join algorithms\n",
    "- Multi-core query parallelism\n",
    "- Serializable ACID transactions\n",
    "\n",
    "## Why Kuzu?\n",
    "\n",
    "Although there are many graph database management systems (GDBMSs) in the market today, Kuzu stands apart because its design and implementation address specific trade-offs that make it a compelling choice for analytical query workloads on large graphs. Below, we list some of the key reasons why you should consider using Kuzu.\n",
    "\n",
    "- Performance and scalability\n",
    "- Usability\n",
    "- Interoperability\n",
    "- Structured property graph model\n",
    "- Open source\n",
    "\n",
    "## [Install Kuzu](https://kuzudb.github.io/docs/installation/)\n",
    "\n",
    "### Command Line (Shell)\n",
    "\n",
    "```bash\n",
    "# Linux\n",
    "curl -L -O https://github.com/kuzudb/kuzu/releases/download/v0.11.3/kuzu_cli-linux-x86_64.tar.gz\n",
    "curl -L -O https://github.com/kuzudb/kuzu/releases/download/v0.11.3/kuzu_cli-linux-aarch64.tar.gz\n",
    "\n",
    "tar xzf kuzu_cli-*.tar.gz\n",
    "\n",
    "# You can now run Kuzu from the command line.\n",
    "./kuzu\n",
    "\n",
    "# macOS\n",
    "brew install kuzu\n",
    "\n",
    "# You can now run Kuzu from the command line.\n",
    "kuzu\n",
    "```\n",
    "\n",
    "### Python\n",
    "```bash\n",
    "# UV\n",
    "uv add kuzu\n",
    "\n",
    "# pip\n",
    "pip install kuzu\n",
    "```\n",
    "\n",
    "### Node.js\n",
    "```bash\n",
    "npm install kuzu\n",
    "```\n",
    "\n",
    "### Java\n",
    "```\n",
    "<dependency>\n",
    "  <groupId>com.kuzudb</groupId>\n",
    "  <artifactId>kuzu</artifactId>\n",
    "  <version>0.11.3</version>\n",
    "</dependency>\n",
    "```\n",
    "\n",
    "### Rust\n",
    "```\n",
    "cargo add kuzu\n",
    "```\n",
    "\n",
    "### Go\n",
    "```\n",
    "go get github.com/kuzudb/go-kuzu@v0.11.3\n",
    "```\n",
    "\n",
    "...\n",
    "\n",
    "## Kuzu Explorer\n",
    "\n",
    "Kuzu Explorer is a web-based GUI for Kuzu. It allows you to explore and query your Kuzu database using a web browser. Refer to the Kuzu Explorer [GitHub repo](https://github.com/kuzudb/explorer) for more details.\n",
    "\n",
    "## Kuzu MCP Server\n",
    "\n",
    "Our Model Context Protocol server allows you to expose your Kuzu database as a tool that can be used by LLMs and agents. Refer to the Kuzu-MCP [GitHub repo](https://github.com/kuzudb/kuzu-mcp-server) for more details."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b46a26b4-5e18-4fc4-bca1-00d66c0aaaf7",
   "metadata": {},
   "source": [
    "# Create your first graph\n",
    "\n",
    "Kuzu implements a **structured property graph model** and requires a pre-defined schema.\n",
    "\n",
    "- Schema definition involves node and relationship tables and their associated properties.\n",
    "- Each property key is strongly typed and these types must be explicitly declared.\n",
    "- For node tables, a primary key must be defined.\n",
    "- For relationship tables, no primary key is required.\n",
    "\n",
    "## Persistence\n",
    "\n",
    "Kuzu supports both **on-disk** and **in-memory** modes of operation. The mode is determined at the time of creating the database, as explained below.\n",
    "\n",
    "### On-disk database\n",
    "\n",
    "If you specify a database path when initializing a database, such as `example.kuzu`, Kuzu will operate in the **on-disk** mode. In this mode, Kuzu persists all data to disk at the given path. All transactions are logged to a Write-Ahead Log (WAL) and updates are periodically merged into the database files during checkpoints.\n",
    "\n",
    "### In-memory database\n",
    "\n",
    "If you omit the database path, by specifying it as `\"\"` or `:memory:`, Kuzu will operate in the in-memory mode. In this mode, there are no writes to the WAL, and no data is persisted to disk. All data is lost when the process finishes.\n",
    "\n",
    "# Quickstart\n",
    "\n",
    "Install `kuzu`: `uv pip install kuzu`\n",
    "\n",
    "\n",
    "Download data\n",
    "\n",
    "```bash\n",
    "mkdir ./data/\n",
    "curl -L -o ./data/city.csv https://raw.githubusercontent.com/kuzudb/kuzu/refs/heads/master/dataset/demo-db/csv/city.csv\n",
    "curl -L -o ./data/user.csv https://raw.githubusercontent.com/kuzudb/kuzu/refs/heads/master/dataset/demo-db/csv/user.csv\n",
    "curl -L -o ./data/follows.csv https://raw.githubusercontent.com/kuzudb/kuzu/refs/heads/master/dataset/demo-db/csv/follows.csv\n",
    "curl -L -o ./data/lives-in.csv https://raw.githubusercontent.com/kuzudb/kuzu/refs/heads/master/dataset/demo-db/csv/lives-in.csv\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "d842ec61-6682-4964-a5e5-fc2f5c7e4760",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Adam</th>\n",
       "      <th>30</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Karissa</td>\n",
       "      <td>40</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Zhang</td>\n",
       "      <td>50</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      Adam  30\n",
       "0  Karissa  40\n",
       "1    Zhang  50"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Inspect data\n",
    "import pandas as pd\n",
    "\n",
    "df_user = pd.read_csv(\"./data/user.csv\")\n",
    "df_user.head(2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "0ff6f8cf-54e7-4f8c-b997-762408301a56",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Waterloo</th>\n",
       "      <th>150000</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Kitchener</td>\n",
       "      <td>200000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Guelph</td>\n",
       "      <td>75000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    Waterloo  150000\n",
       "0  Kitchener  200000\n",
       "1     Guelph   75000"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_city = pd.read_csv(\"./data/city.csv\")\n",
    "df_city.head(2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "85a97654-9116-4623-93f0-d8bfaf6a2cb7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Adam</th>\n",
       "      <th>Karissa</th>\n",
       "      <th>2020</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Adam</td>\n",
       "      <td>Zhang</td>\n",
       "      <td>2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Karissa</td>\n",
       "      <td>Zhang</td>\n",
       "      <td>2021</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      Adam Karissa  2020\n",
       "0     Adam   Zhang  2020\n",
       "1  Karissa   Zhang  2021"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_follows = pd.read_csv(\"./data/follows.csv\")\n",
    "df_follows.head(2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "85476338-c72c-4f99-be07-205d0133b432",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Adam</th>\n",
       "      <th>Waterloo</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Karissa</td>\n",
       "      <td>Waterloo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Zhang</td>\n",
       "      <td>Kitchener</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      Adam   Waterloo\n",
       "0  Karissa   Waterloo\n",
       "1    Zhang  Kitchener"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_livesin = pd.read_csv(\"./data/lives-in.csv\")\n",
    "df_livesin.head(2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "d51b6d54-e0d3-4bed-920b-ecc4d5db2ee3",
   "metadata": {},
   "outputs": [],
   "source": [
    "import kuzu\n",
    "\n",
    "# Create an empty on-disk database and connect to it\n",
    "db = kuzu.Database(\"example.kuzu\")\n",
    "conn = kuzu.Connection(db)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "2ceccda8-e264-43f7-acea-35e0c3aa7fa5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<kuzu.query_result.QueryResult at 0x7faa8ae98e30>"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create schema\n",
    "conn.execute(\"CREATE NODE TABLE User(name STRING PRIMARY KEY, age INT64)\")\n",
    "conn.execute(\"CREATE NODE TABLE City(name STRING PRIMARY KEY, population INT64)\")\n",
    "conn.execute(\"CREATE REL TABLE Follows(FROM User TO User, since INT64)\")\n",
    "conn.execute(\"CREATE REL TABLE LivesIn(FROM User TO City)\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "f18abea7-1343-4e42-baa9-273e2b63b4d1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<kuzu.query_result.QueryResult at 0x7faa8a776180>"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Insert data\n",
    "conn.execute('COPY User FROM \"./data/user.csv\"')\n",
    "conn.execute('COPY City FROM \"./data/city.csv\"')\n",
    "conn.execute('COPY Follows FROM \"./data/follows.csv\"')\n",
    "conn.execute('COPY LivesIn FROM \"./data/lives-in.csv\"')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "35ccb682-6460-4d82-966f-2ea1222e4a27",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['Adam', 'Karissa', 2020]\n",
      "['Adam', 'Zhang', 2020]\n",
      "['Karissa', 'Zhang', 2021]\n",
      "['Zhang', 'Noura', 2022]\n"
     ]
    }
   ],
   "source": [
    "import textwrap\n",
    "\n",
    "# Execute Cypher query\n",
    "response = conn.execute(\n",
    "    textwrap.dedent(\n",
    "        \"\"\"\n",
    "        MATCH (a:User)-[f:Follows]->(b:User)\n",
    "        RETURN a.name, b.name, f.since;\n",
    "        \"\"\"\n",
    "    )\n",
    ")\n",
    "\n",
    "for row in response:\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "8c4cce9e-9e68-4271-a2ee-7fbc8a3cb287",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'a.name': 'Adam', 'b.name': 'Karissa', 'f.since': 2020}\n",
      "{'a.name': 'Adam', 'b.name': 'Zhang', 'f.since': 2020}\n",
      "{'a.name': 'Karissa', 'b.name': 'Zhang', 'f.since': 2021}\n",
      "{'a.name': 'Zhang', 'b.name': 'Noura', 'f.since': 2022}\n"
     ]
    }
   ],
   "source": [
    "# Output as a dictionary\n",
    "response = conn.execute(\n",
    "    \"\"\"\n",
    "    MATCH (a:User)-[f:Follows]->(b:User)\n",
    "    RETURN a.name, b.name, f.since;\n",
    "    \"\"\"\n",
    ")\n",
    "for row in response.rows_as_dict():\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "589a4aed-3fd1-4514-aced-8a07b148f55f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "    a.name   b.name  f.since\n",
      "0     Adam  Karissa     2020\n",
      "1     Adam    Zhang     2020\n",
      "2  Karissa    Zhang     2021\n",
      "3    Zhang    Noura     2022\n"
     ]
    }
   ],
   "source": [
    "# pip install pandas\n",
    "response = conn.execute(\n",
    "    \"\"\"\n",
    "    MATCH (a:User)-[f:Follows]->(b:User)\n",
    "    RETURN a.name, b.name, f.since;\n",
    "    \"\"\"\n",
    ")\n",
    "print(response.get_as_df())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "16e3d413-a422-4ad0-a253-68c5cf53f641",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\u001b[2mUsing Python 3.12.11 environment at: /home/locch/Works/graph-exp/.venv\u001b[0m\n",
      "\u001b[2mAudited \u001b[1m2 packages\u001b[0m \u001b[2min 1ms\u001b[0m\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "!uv pip install polars pyarrow"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "ce02eb2f-2552-4e25-8653-98ccc3ff9508",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "shape: (4, 3)\n",
      "┌─────────┬─────────┬─────────┐\n",
      "│ a.name  ┆ b.name  ┆ f.since │\n",
      "│ ---     ┆ ---     ┆ ---     │\n",
      "│ str     ┆ str     ┆ i64     │\n",
      "╞═════════╪═════════╪═════════╡\n",
      "│ Adam    ┆ Karissa ┆ 2020    │\n",
      "│ Adam    ┆ Zhang   ┆ 2020    │\n",
      "│ Karissa ┆ Zhang   ┆ 2021    │\n",
      "│ Zhang   ┆ Noura   ┆ 2022    │\n",
      "└─────────┴─────────┴─────────┘\n"
     ]
    }
   ],
   "source": [
    "# pip install polars\n",
    "response = conn.execute(\n",
    "    \"\"\"\n",
    "    MATCH (a:User)-[f:Follows]->(b:User)\n",
    "    RETURN a.name, b.name, f.since;\n",
    "    \"\"\"\n",
    ")\n",
    "print(response.get_as_pl())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "0ea8566c-e134-41f4-aa53-cfe64973143d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "pyarrow.Table\n",
      "a.name: string\n",
      "b.name: string\n",
      "f.since: int64\n",
      "----\n",
      "a.name: [[\"Adam\",\"Adam\",\"Karissa\",\"Zhang\"]]\n",
      "b.name: [[\"Karissa\",\"Zhang\",\"Zhang\",\"Noura\"]]\n",
      "f.since: [[2020,2020,2021,2022]]\n"
     ]
    }
   ],
   "source": [
    "# pip install pyarrow\n",
    "response = conn.execute(\n",
    "    \"\"\"\n",
    "    MATCH (a:User)-[f:Follows]->(b:User)\n",
    "    RETURN a.name, b.name, f.since;\n",
    "    \"\"\"\n",
    ")\n",
    "print(response.get_as_arrow())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "29a9b617-98ae-4a1a-95cb-dfedff77e2cf",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a6b0f834-8d28-4f3d-bddb-0c0676818ee2",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
