{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "8f0f8d0c-4f34-4995-83e6-e834ae4d2238",
   "metadata": {},
   "source": [
    "# Vector Indexes\n",
    "\n",
    "In the last lesson, you learned about embeddings, vectors and their role in RAG.\n",
    "\n",
    "In this lesson, you will learn how to use a vector index in Neo4j to compare embeddings to find similar data.\n",
    "\n",
    "## Movie Plots\n",
    "\n",
    "GraphAcademy created a Neo4j sandbox of movie recommendations when you enrolled in this course. The recommendations database contains over 9000 movies, 15000 actors, and over 100000 user ratings.\n",
    "\n",
    "Each movie has a .plot property."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "74f872f4-9044-45ca-9843-d74f54ee9a80",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv\n",
    "load_dotenv()\n",
    "\n",
    "import textwrap\n",
    "from neo4j import GraphDatabase\n",
    "from utils import execute_query, create_embedding\n",
    "\n",
    "neo4j_uri = os.getenv(\"NEO4J_URI\")\n",
    "neo4j_user = os.getenv(\"NEO4J_USERNAME\")\n",
    "neo4j_pass = os.getenv(\"NEO4J_PASSWORD\")\n",
    "neo4j_db = os.getenv(\"NEO4J_DATABASE\")\n",
    "\n",
    "neo4j_driver = GraphDatabase.driver(neo4j_uri, auth=(neo4j_user, neo4j_pass))\n",
    "\n",
    "neo4j_driver.verify_connectivity()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "f630e06f-d8e0-4693-803a-fe77cf5fc7e5",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher = textwrap.dedent(\"\"\"\n",
    "LOAD CSV WITH HEADERS\n",
    "FROM 'https://data.neo4j.com/rec-embed/movie-plot-embeddings-1k.csv'\n",
    "AS row\n",
    "MATCH (m:Movie {movieId: row.movieId})\n",
    "CALL db.create.setNodeVectorProperty(m, 'plotEmbedding', apoc.convert.fromJsonList(row.embedding));\n",
    "\"\"\")\n",
    "\n",
    "result = execute_query(neo4j_driver, cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "623287df-f3d8-4580-b250-99109c7cd91d",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher = textwrap.dedent(\"\"\"\n",
    "CREATE VECTOR INDEX moviePlots IF NOT EXISTS\n",
    "FOR (m:Movie)\n",
    "ON m.plotEmbedding\n",
    "OPTIONS {indexConfig: {\n",
    " `vector.dimensions`: 1536,\n",
    " `vector.similarity_function`: 'cosine'\n",
    "}};\n",
    "\"\"\")\n",
    "\n",
    "result = execute_query(neo4j_driver, cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "956a634a-c36a-44e3-8e6b-d6d15733819e",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: title)} {position: line: 2, column: 17, offset: 17} for query: '\\nMATCH (m:Movie {title: \"Toy Story\"})\\nRETURN m.title AS title, m.plot AS plot\\n'\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: title)} {position: line: 3, column: 10, offset: 47} for query: '\\nMATCH (m:Movie {title: \"Toy Story\"})\\nRETURN m.title AS title, m.plot AS plot\\n'\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: plot)} {position: line: 3, column: 28, offset: 65} for query: '\\nMATCH (m:Movie {title: \"Toy Story\"})\\nRETURN m.title AS title, m.plot AS plot\\n'\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = textwrap.dedent(\"\"\"\n",
    "MATCH (m:Movie {title: \"Toy Story\"})\n",
    "RETURN m.title AS title, m.plot AS plot\n",
    "\"\"\")\n",
    "\n",
    "result = execute_query(neo4j_driver, cypher)\n",
    "\n",
    "result"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "faefdaa3-38de-47cf-9444-d0f8add3a623",
   "metadata": {},
   "source": [
    "## Plot Embeddings\n",
    "\n",
    "Embeddings have been created for 1000 movie plots. The embedding is stored in the .plotEmbedding property of the Movie nodes."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "74d129ba-d5f7-45aa-a3d8-792c18a798cc",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: title)} {position: line: 2, column: 17, offset: 17} for query: '\\nMATCH (m:Movie {title: \"Toy Story\"})\\nRETURN m.title AS title, m.plot AS plot, m.plotEmbedding\\n'\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: title)} {position: line: 3, column: 10, offset: 47} for query: '\\nMATCH (m:Movie {title: \"Toy Story\"})\\nRETURN m.title AS title, m.plot AS plot, m.plotEmbedding\\n'\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: plot)} {position: line: 3, column: 28, offset: 65} for query: '\\nMATCH (m:Movie {title: \"Toy Story\"})\\nRETURN m.title AS title, m.plot AS plot, m.plotEmbedding\\n'\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = textwrap.dedent(\"\"\"\n",
    "MATCH (m:Movie {title: \"Toy Story\"})\n",
    "RETURN m.title AS title, m.plot AS plot, m.plotEmbedding\n",
    "\"\"\")\n",
    "\n",
    "result = execute_query(neo4j_driver, cypher)\n",
    "\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "deb7b3e8-f6ce-4b85-b978-802acc92e1f9",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: title)} {position: line: 4, column: 10, offset: 60} for query: '\\nMATCH (m:Movie)\\nWHERE m.plotEmbedding IS NOT NULL\\nRETURN m.title, m.plot\\n'\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: plot)} {position: line: 4, column: 19, offset: 69} for query: '\\nMATCH (m:Movie)\\nWHERE m.plotEmbedding IS NOT NULL\\nRETURN m.title, m.plot\\n'\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = textwrap.dedent(\"\"\"\n",
    "MATCH (m:Movie)\n",
    "WHERE m.plotEmbedding IS NOT NULL\n",
    "RETURN m.title, m.plot\n",
    "\"\"\")\n",
    "\n",
    "result = execute_query(neo4j_driver, cypher)\n",
    "\n",
    "result"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b618681c-b5e3-4612-b329-8f345c2f6809",
   "metadata": {},
   "source": [
    "## Querying Vector Indexes\n",
    "\n",
    "You can query the moviePlots index using the [db.index.vector.queryNodes()](https://neo4j.com/docs/cypher-manual/current/indexes/semantic-indexes/vector-indexes/?_gl=1*1ne1ez8*_ga*MTkzMzgxNTk1LjE3NTcyNTg0MzQ.*_ga_DZP8Z65KK4*czE3NjMxODcxMDUkbzQ1JGcxJHQxNzYzMTg3NDE4JGoyNiRsMCRoMA..*_gcl_au*MjEzNTI4NjkxNy4xNzU3MjU4NDMzLjc4MDQ1OTczLjE3NTg0MTY3NjUuMTc1ODQxNjc2NA..*_ga_DL38Q8KGQC*czE3NjMxODcxMDUkbzQ1JGcxJHQxNzYzMTg3NDE4JGoyNiRsMCRoMA..#query-vector-index) procedure.\n",
    "\n",
    "The procedure returns the requested number of approximate nearest neighbor nodes and their similarity score, ordered by the score.\n",
    "\n",
    "```cypher\n",
    "CALL db.index.vector.queryNodes(\n",
    "    indexName :: STRING,\n",
    "    numberOfNearestNeighbours :: INTEGER,\n",
    "    query :: LIST<FLOAT>\n",
    ") YIELD node, score\n",
    "```\n",
    "\n",
    "\n",
    "The procedure accepts three parameters:\n",
    "\n",
    "1. indexName - The name of the vector index\n",
    "\n",
    "2. numberOfNearestNeighbours - The number of results to return\n",
    "\n",
    "3. query - A list of floats that represent an embedding\n",
    "\n",
    "The procedure yields two arguments:\n",
    "\n",
    "4. A node which matches the query\n",
    "\n",
    "5. A similarity score ranging from 0.0 to 1.0.\n",
    "\n",
    "You can use this procedure to find the closest embedding value to a given value.\n",
    "\n",
    "## Querying Similar Movie Plots\n",
    "\n",
    "You can use the moviePlots vector index to find movies with similar plots.\n",
    "\n",
    "Review this Cypher before running it.\n",
    "\n",
    "```cypher\n",
    "MATCH (m:Movie {title: 'Toy Story'})\n",
    "\n",
    "CALL db.index.vector.queryNodes('moviePlots', 6, m.plotEmbedding)\n",
    "YIELD node, score\n",
    "\n",
    "RETURN node.title AS title, node.plot AS plot, score\n",
    "```\n",
    "\n",
    "The query finds the Toy Story Movie node and uses the .plotEmbedding property to find the most similar plots.\n",
    "\n",
    "The `db.index.vector.queryNodes()` procedure uses the moviePlots vector index to find similar embeddings.\n",
    "\n",
    "Run the query. The procedure returns the requested number of nodes and their similarity score, ordered by the score."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "6dabaf32-8f48-4d26-94dc-5bc01bc995f7",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: title)} {position: line: 2, column: 17, offset: 17} for query: \"\\nMATCH (m:Movie {title: 'Toy Story'})\\n\\nCALL db.index.vector.queryNodes('moviePlots', 6, m.plotEmbedding)\\nYIELD node, score\\n\\nRETURN node.title AS title, node.plot AS plot, score\\n\"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: title)} {position: line: 7, column: 13, offset: 136} for query: \"\\nMATCH (m:Movie {title: 'Toy Story'})\\n\\nCALL db.index.vector.queryNodes('moviePlots', 6, m.plotEmbedding)\\nYIELD node, score\\n\\nRETURN node.title AS title, node.plot AS plot, score\\n\"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: plot)} {position: line: 7, column: 34, offset: 157} for query: \"\\nMATCH (m:Movie {title: 'Toy Story'})\\n\\nCALL db.index.vector.queryNodes('moviePlots', 6, m.plotEmbedding)\\nYIELD node, score\\n\\nRETURN node.title AS title, node.plot AS plot, score\\n\"\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = textwrap.dedent(\"\"\"\n",
    "MATCH (m:Movie {title: 'Toy Story'})\n",
    "\n",
    "CALL db.index.vector.queryNodes('moviePlots', 6, m.plotEmbedding)\n",
    "YIELD node, score\n",
    "\n",
    "RETURN node.title AS title, node.plot AS plot, score\n",
    "\"\"\")\n",
    "\n",
    "result = execute_query(neo4j_driver, cypher)\n",
    "\n",
    "result"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c169bdc9-2d1e-43c5-a8e7-e690f8661501",
   "metadata": {},
   "source": [
    "## Generate Embeddings\n",
    "\n",
    "You can generate a new embedding in Cypher using the [genai.vector.encode](https://neo4j.com/docs/cypher-manual/current/genai-integrations/?_gl=1*1mimogn*_ga*MTkzMzgxNTk1LjE3NTcyNTg0MzQ.*_ga_DZP8Z65KK4*czE3NjMxODcxMDUkbzQ1JGcxJHQxNzYzMTg3NDE4JGoyNiRsMCRoMA..*_gcl_au*MjEzNTI4NjkxNy4xNzU3MjU4NDMzLjc4MDQ1OTczLjE3NTg0MTY3NjUuMTc1ODQxNjc2NA..*_ga_DL38Q8KGQC*czE3NjMxODcxMDUkbzQ1JGcxJHQxNzYzMTg3NDE4JGoyNiRsMCRoMA..#single-embedding) function:\n",
    "\n",
    "```cypher\n",
    "WITH genai.vector.encode(\n",
    "    \"Text to create embeddings for\",\n",
    "    \"OpenAI\",\n",
    "    { token: \"sk-...\" }) AS embedding\n",
    "RETURN embedding\n",
    "```\n",
    "\n",
    "## Generate a Plot Embedding\n",
    "\n",
    "You can use the embedding to query the vector index to find similar movies.\n",
    "\n",
    "This query, creates and embedding for the text \"A mysterious spaceship lands Earth\" and uses it to query the moviePlots vector index for the 6 most similar movie plots.\n",
    "\n",
    "```cypher\n",
    "WITH genai.vector.encode(\n",
    "    \"A mysterious spaceship lands Earth\",\n",
    "    \"OpenAI\",\n",
    "    { token: \"sk-...\" }) AS myMoviePlot\n",
    "CALL db.index.vector.queryNodes('moviePlots', 6, myMoviePlot)\n",
    "YIELD node, score\n",
    "RETURN node.title, node.plot, score\n",
    "```\n",
    "\n",
    "## Considerations\n",
    "\n",
    "Using embeddings and vectors is relatively straightforward and can quickly yield results. The downside to this approach is that it relies heavily on the embeddings and similarity function to produce valid results.\n",
    "\n",
    "This approach is also a black box. There are 1536 dimensions; it would be impossible to determine how the vectors are structured and how they influenced the similarity score.\n",
    "\n",
    "The movies returned look similar, but without reading and comparing them, you would have no way of verifying that the results are correct.\n",
    "\n",
    "Vectors work well for:\n",
    "\n",
    "- Contextual or Meaning Based Questions\n",
    "\n",
    "- Fuzzy or Vague queries\n",
    "\n",
    "- Broad or Open-Ended questions\n",
    "\n",
    "- Complex queries with multiple concepts\n",
    "\n",
    "Vectors are ineffective for:\n",
    "\n",
    "- Highly Specific or Fact-Based Questions\n",
    "\n",
    "- Numerical or Exact-Match Queries\n",
    "\n",
    "- Boolean or Logical Queries\n",
    "\n",
    "- Ambiguous or Unclear Queries without Context\n",
    "\n",
    "- Specialized Knowledge\n",
    "\n",
    "In the next lesson you will look at how you can improve the results by using a combination of vector and graph queries."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "97adc537-b482-401c-8526-b5b53026d993",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
