{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "8f0f8d0c-4f34-4995-83e6-e834ae4d2238",
   "metadata": {},
   "source": [
    "# Vector Indexes\n",
    "\n",
    "In the last lesson, you learned about embeddings, vectors and their role in RAG.\n",
    "\n",
    "In this lesson, you will learn how to use a vector index in Neo4j to compare embeddings to find similar data.\n",
    "\n",
    "## Movie Plots\n",
    "\n",
    "GraphAcademy created a Neo4j sandbox of movie recommendations when you enrolled in this course. The recommendations database contains over 9000 movies, 15000 actors, and over 100000 user ratings.\n",
    "\n",
    "Each movie has a .plot property."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "74f872f4-9044-45ca-9843-d74f54ee9a80",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv\n",
    "load_dotenv()\n",
    "\n",
    "import textwrap\n",
    "from neo4j import GraphDatabase\n",
    "from utils import execute_query, create_embedding\n",
    "\n",
    "neo4j_uri = os.getenv(\"NEO4J_URI\")\n",
    "neo4j_user = os.getenv(\"NEO4J_USERNAME\")\n",
    "neo4j_pass = os.getenv(\"NEO4J_PASSWORD\")\n",
    "neo4j_db = os.getenv(\"NEO4J_DATABASE\")\n",
    "\n",
    "neo4j_driver = GraphDatabase.driver(neo4j_uri, auth=(neo4j_user, neo4j_pass))\n",
    "\n",
    "neo4j_driver.verify_connectivity()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "f630e06f-d8e0-4693-803a-fe77cf5fc7e5",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher = textwrap.dedent(\"\"\"\n",
    "LOAD CSV WITH HEADERS\n",
    "FROM 'https://data.neo4j.com/rec-embed/movie-plot-embeddings-1k.csv'\n",
    "AS row\n",
    "MATCH (m:Movie {movieId: toInteger(row.movieId)})\n",
    "CALL db.create.setNodeVectorProperty(\n",
    "  m,\n",
    "  'plotEmbedding',\n",
    "  apoc.convert.fromJsonList(row.embedding)\n",
    ");\n",
    "\"\"\")\n",
    "result = execute_query(neo4j_driver, cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "05389be5-85e4-4cc2-829c-df977bb59c2b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'movies': 93,\n",
       "  'movies_with_embedding': 93,\n",
       "  'sample_keys': ['plotEmbedding',\n",
       "   'runtime',\n",
       "   'imdbVotes',\n",
       "   'revenue',\n",
       "   'countries',\n",
       "   'plot',\n",
       "   'budget',\n",
       "   'imdbRating',\n",
       "   'released',\n",
       "   'title',\n",
       "   'year',\n",
       "   'languages',\n",
       "   'tmdbId',\n",
       "   'movieId',\n",
       "   'imdbId']}]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = textwrap.dedent(\"\"\"\n",
    "MATCH (m:Movie)\n",
    "RETURN count(m) AS movies,\n",
    "       count(m.plotEmbedding) AS movies_with_embedding,\n",
    "       head(collect(keys(m))) AS sample_keys\n",
    "LIMIT 1;\n",
    "\"\"\")\n",
    "\n",
    "result = execute_query(neo4j_driver, cypher)\n",
    "\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "184ccd39-6be7-4c15-9e12-3d4bb69a8a65",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'m.title': 'Toy Story',\n",
       "  'm.plot': \"A cowboy doll is profoundly threatened and jealous when a new spaceman figure supplants him as top toy in a boy's room.\"}]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = textwrap.dedent(\"\"\"\n",
    "MATCH (m:Movie)\n",
    "WHERE m.plotEmbedding IS NOT NULL\n",
    "RETURN m.title, m.plot\n",
    "LIMIT 1\n",
    "\"\"\")\n",
    "\n",
    "result = execute_query(neo4j_driver, cypher)\n",
    "\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "623287df-f3d8-4580-b250-99109c7cd91d",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher = textwrap.dedent(\"\"\"\n",
    "CREATE VECTOR INDEX moviePlots IF NOT EXISTS\n",
    "FOR (m:Movie)\n",
    "ON m.plotEmbedding\n",
    "OPTIONS {indexConfig: {\n",
    " `vector.dimensions`: 1536,\n",
    " `vector.similarity_function`: 'cosine'\n",
    "}};\n",
    "\"\"\")\n",
    "\n",
    "result = execute_query(neo4j_driver, cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "956a634a-c36a-44e3-8e6b-d6d15733819e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'title': 'Toy Story',\n",
       "  'plot': \"A cowboy doll is profoundly threatened and jealous when a new spaceman figure supplants him as top toy in a boy's room.\"}]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = textwrap.dedent(\"\"\"\n",
    "MATCH (m:Movie {title: \"Toy Story\"})\n",
    "RETURN m.title AS title, m.plot AS plot\n",
    "\"\"\")\n",
    "\n",
    "result = execute_query(neo4j_driver, cypher)\n",
    "\n",
    "result"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "faefdaa3-38de-47cf-9444-d0f8add3a623",
   "metadata": {},
   "source": [
    "## Plot Embeddings\n",
    "\n",
    "Embeddings have been created for 1000 movie plots. The embedding is stored in the .plotEmbedding property of the Movie nodes."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "74d129ba-d5f7-45aa-a3d8-792c18a798cc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'title': 'Toy Story',\n",
       "  'plot': \"A cowboy doll is profoundly threatened and jealous when a new spaceman figure supplants him as top toy in a boy's room.\",\n",
       "  'm.plotEmbedding': [-0.026989128440618515,\n",
       "   -0.024155009537935257,\n",
       "   0.006058253347873688,\n",
       "   -0.024324016645550728,\n",
       "   -0.022516941651701927,\n",
       "   -0.0050864629447460175,\n",
       "   -0.013442561961710453,\n",
       "   -0.004462436772882938,\n",
       "   0.001889954088255763,\n",
       "   -0.017147717997431755,\n",
       "   0.00504421116784215,\n",
       "   -0.007975833490490913,\n",
       "   0.03221534565091133,\n",
       "   -0.012272513471543789,\n",
       "   0.01178499311208725,\n",
       "   0.02133389189839363,\n",
       "   0.028627198189496994,\n",
       "   -0.0005025522550567985,\n",
       "   0.014040587469935417,\n",
       "   -0.014157592318952084,\n",
       "   0.0014495606301352382,\n",
       "   0.008027835749089718,\n",
       "   -0.0222049281001091,\n",
       "   -0.025013046339154243,\n",
       "   0.004394183866679668,\n",
       "   -0.00825534574687481,\n",
       "   0.023660989478230476,\n",
       "   -0.025416063144803047,\n",
       "   0.037181556224823,\n",
       "   0.00314450659789145,\n",
       "   0.008619360625743866,\n",
       "   -0.012064504437148571,\n",
       "   0.006025752052664757,\n",
       "   -0.006955291144549847,\n",
       "   -0.03286537528038025,\n",
       "   -0.024545026943087578,\n",
       "   0.004871953744441271,\n",
       "   -0.028627198189496994,\n",
       "   0.012103506363928318,\n",
       "   -0.005560982506722212,\n",
       "   0.011414477601647377,\n",
       "   0.03746756538748741,\n",
       "   -0.029381228610873222,\n",
       "   0.004104921594262123,\n",
       "   -0.006922789383679628,\n",
       "   0.010822952724993229,\n",
       "   0.01739472709596157,\n",
       "   -0.026443105190992355,\n",
       "   -0.016094673424959183,\n",
       "   0.00015174072177615017,\n",
       "   0.01706971414387226,\n",
       "   0.029225222766399384,\n",
       "   -0.034815456718206406,\n",
       "   -0.03637552261352539,\n",
       "   -0.008164341561496258,\n",
       "   -0.01255202479660511,\n",
       "   -0.025195054709911346,\n",
       "   0.007371308282017708,\n",
       "   0.016393685713410378,\n",
       "   -0.007423310540616512,\n",
       "   0.0019370809895917773,\n",
       "   0.007949832826852798,\n",
       "   0.0030827538575977087,\n",
       "   0.0033183887135237455,\n",
       "   -0.01323455385863781,\n",
       "   0.015899665653705597,\n",
       "   -0.015847662463784218,\n",
       "   -0.006087504792958498,\n",
       "   0.0027106134220957756,\n",
       "   -0.012298514135181904,\n",
       "   0.027535151690244675,\n",
       "   0.025988087058067322,\n",
       "   0.009178384207189083,\n",
       "   0.01307204645127058,\n",
       "   0.019812827929854393,\n",
       "   -0.0020524607971310616,\n",
       "   -0.016068672761321068,\n",
       "   0.017134716734290123,\n",
       "   0.0075143142603337765,\n",
       "   0.01088145561516285,\n",
       "   0.01843477040529251,\n",
       "   -0.017381727695465088,\n",
       "   -0.01864277943968773,\n",
       "   0.007488313131034374,\n",
       "   0.025065047666430473,\n",
       "   0.0016998210921883583,\n",
       "   -0.014417602680623531,\n",
       "   0.02899121306836605,\n",
       "   -0.03790958598256111,\n",
       "   0.024207012727856636,\n",
       "   -0.001176549238152802,\n",
       "   0.009477396495640278,\n",
       "   0.008580358698964119,\n",
       "   0.010686446912586689,\n",
       "   -0.011440478265285492,\n",
       "   0.0078198267146945,\n",
       "   -0.008742866106331348,\n",
       "   0.02056686021387577,\n",
       "   0.0035588988102972507,\n",
       "   -0.03510146960616112,\n",
       "   0.000859660969581455,\n",
       "   0.006581525318324566,\n",
       "   -0.01667969860136509,\n",
       "   0.003191633615642786,\n",
       "   0.008846869692206383,\n",
       "   0.010705947875976562,\n",
       "   0.0100884223356843,\n",
       "   -0.0009189759148284793,\n",
       "   0.011797993443906307,\n",
       "   -0.004501438234001398,\n",
       "   -0.00828784704208374,\n",
       "   -0.0008637236314825714,\n",
       "   0.03434743732213974,\n",
       "   -0.037103552371263504,\n",
       "   -0.010601943358778954,\n",
       "   -0.015769660472869873,\n",
       "   0.019071796908974648,\n",
       "   0.010042919777333736,\n",
       "   -0.009145882911980152,\n",
       "   -0.005190466996282339,\n",
       "   0.02641710452735424,\n",
       "   0.026209095492959023,\n",
       "   0.010647444985806942,\n",
       "   -0.007650820072740316,\n",
       "   0.0045534404926002026,\n",
       "   0.01608167216181755,\n",
       "   0.007741823792457581,\n",
       "   -0.016419686377048492,\n",
       "   -0.01452160719782114,\n",
       "   -0.011180467903614044,\n",
       "   0.026326101273298264,\n",
       "   0.02082687057554722,\n",
       "   0.012669029645621777,\n",
       "   -0.0008734740549698472,\n",
       "   -0.038039591163396835,\n",
       "   0.007098297122865915,\n",
       "   -0.035023465752601624,\n",
       "   0.01804475486278534,\n",
       "   -0.0011009835870936513,\n",
       "   -0.023608988150954247,\n",
       "   0.01116096694022417,\n",
       "   0.010426436550915241,\n",
       "   -0.009067879058420658,\n",
       "   0.0016543192323297262,\n",
       "   -0.003490645904093981,\n",
       "   0.023504983633756638,\n",
       "   0.02029384858906269,\n",
       "   0.018850788474082947,\n",
       "   -0.01340356096625328,\n",
       "   0.019734825938940048,\n",
       "   0.007280304562300444,\n",
       "   0.003679153975099325,\n",
       "   -0.00035467109410092235,\n",
       "   -0.01596466824412346,\n",
       "   0.008378850296139717,\n",
       "   0.0049792081117630005,\n",
       "   -0.011927998624742031,\n",
       "   0.0034321434795856476,\n",
       "   -0.0012927416246384382,\n",
       "   -0.020631862804293633,\n",
       "   -0.0011472980258986354,\n",
       "   0.006935790181159973,\n",
       "   0.02691112644970417,\n",
       "   0.0027447398751974106,\n",
       "   0.02024184726178646,\n",
       "   0.020267847925424576,\n",
       "   0.010452437214553356,\n",
       "   -0.0008913498022593558,\n",
       "   0.0067212809808552265,\n",
       "   0.01375457551330328,\n",
       "   0.002058961195871234,\n",
       "   0.021138884127140045,\n",
       "   -0.019513815641403198,\n",
       "   0.036791540682315826,\n",
       "   -0.012844537384808064,\n",
       "   0.01192149892449379,\n",
       "   -0.005232718773186207,\n",
       "   0.03632351756095886,\n",
       "   -0.024870039895176888,\n",
       "   -0.019890831783413887,\n",
       "   -0.043239809572696686,\n",
       "   -0.010439436882734299,\n",
       "   0.004491687752306461,\n",
       "   0.01995583437383175,\n",
       "   -0.006909789051860571,\n",
       "   -0.013962583616375923,\n",
       "   -0.0212818905711174,\n",
       "   -0.012916040606796741,\n",
       "   0.007208801340311766,\n",
       "   0.019773827865719795,\n",
       "   -0.005226218607276678,\n",
       "   0.019344808533787727,\n",
       "   -0.026222096756100655,\n",
       "   -0.0170047115534544,\n",
       "   -0.6652117967605591,\n",
       "   -0.02418101206421852,\n",
       "   0.00019013295241165906,\n",
       "   -0.01597766764461994,\n",
       "   -0.007501313928514719,\n",
       "   0.008177341893315315,\n",
       "   0.00836584996432066,\n",
       "   0.013065546751022339,\n",
       "   -0.011778492480516434,\n",
       "   0.003913163673132658,\n",
       "   -0.016146674752235413,\n",
       "   0.02691112644970417,\n",
       "   0.0028714952059090137,\n",
       "   -0.01623767986893654,\n",
       "   -0.004426685161888599,\n",
       "   0.003415892831981182,\n",
       "   0.0294332318007946,\n",
       "   -0.028029171749949455,\n",
       "   0.013858580030500889,\n",
       "   0.005037710536271334,\n",
       "   -0.014066588133573532,\n",
       "   0.02247793972492218,\n",
       "   -0.0010034794686362147,\n",
       "   0.0001533657923573628,\n",
       "   0.017433729022741318,\n",
       "   0.012864038348197937,\n",
       "   0.033827416598796844,\n",
       "   -0.012591026723384857,\n",
       "   -0.01739472709596157,\n",
       "   0.007033294066786766,\n",
       "   -0.013442561961710453,\n",
       "   0.025533068925142288,\n",
       "   -0.006955291144549847,\n",
       "   0.02576707862317562,\n",
       "   0.058814458549022675,\n",
       "   -0.009366891346871853,\n",
       "   -0.023973003029823303,\n",
       "   0.016497690230607986,\n",
       "   0.017472730949521065,\n",
       "   0.009126381948590279,\n",
       "   -0.011141465976834297,\n",
       "   -0.004511188715696335,\n",
       "   0.01288353931158781,\n",
       "   -0.01946181431412697,\n",
       "   -0.010426436550915241,\n",
       "   0.008430852554738522,\n",
       "   0.01979982852935791,\n",
       "   -0.011505480855703354,\n",
       "   -0.004494938068091869,\n",
       "   -0.012272513471543789,\n",
       "   0.014664613641798496,\n",
       "   -0.0023482232354581356,\n",
       "   0.010055921040475368,\n",
       "   0.008801368065178394,\n",
       "   0.00784582830965519,\n",
       "   0.009854412637650967,\n",
       "   0.024688033387064934,\n",
       "   -0.002237718552350998,\n",
       "   -0.016887705773115158,\n",
       "   -0.01887678913772106,\n",
       "   0.015990668907761574,\n",
       "   0.004098421428352594,\n",
       "   -0.011154466308653355,\n",
       "   0.019604820758104324,\n",
       "   -0.01963082142174244,\n",
       "   0.036609530448913574,\n",
       "   -0.008788367733359337,\n",
       "   0.0002963717852253467,\n",
       "   0.006302013527601957,\n",
       "   -0.026651114225387573,\n",
       "   0.02494804374873638,\n",
       "   0.029173219576478004,\n",
       "   -0.014703614637255669,\n",
       "   -0.0006041190354153514,\n",
       "   0.0016721949214115739,\n",
       "   0.030369270592927933,\n",
       "   0.0362195149064064,\n",
       "   0.00043836209806613624,\n",
       "   0.008508855476975441,\n",
       "   -0.00010583255061646923,\n",
       "   0.027873165905475616,\n",
       "   0.012207510881125927,\n",
       "   -0.02904321439564228,\n",
       "   0.003562148893252015,\n",
       "   0.03993767127394676,\n",
       "   -0.014989626593887806,\n",
       "   0.0006061503663659096,\n",
       "   0.026391103863716125,\n",
       "   -0.0021077131386846304,\n",
       "   -0.01613367535173893,\n",
       "   0.008209843188524246,\n",
       "   0.029225222766399384,\n",
       "   -0.02735314331948757,\n",
       "   -0.032345354557037354,\n",
       "   -0.011700489558279514,\n",
       "   -0.0035198971163481474,\n",
       "   0.0014284347416833043,\n",
       "   0.011427477933466434,\n",
       "   0.006968291476368904,\n",
       "   -0.05595434084534645,\n",
       "   -0.01732972450554371,\n",
       "   -0.0009531023679301143,\n",
       "   -0.021294889971613884,\n",
       "   0.010959458537399769,\n",
       "   -0.0027317393105477095,\n",
       "   0.005164465866982937,\n",
       "   0.015444645658135414,\n",
       "   0.033723410218954086,\n",
       "   0.026456106454133987,\n",
       "   -0.04386383295059204,\n",
       "   0.01913680136203766,\n",
       "   0.007098297122865915,\n",
       "   -0.0011172342346981168,\n",
       "   -0.008105838671326637,\n",
       "   -0.005515480879694223,\n",
       "   -0.02652110904455185,\n",
       "   0.031591322273015976,\n",
       "   -0.006376766599714756,\n",
       "   0.032787371426820755,\n",
       "   -0.02044985629618168,\n",
       "   0.0071502989158034325,\n",
       "   0.008820869028568268,\n",
       "   0.019929833710193634,\n",
       "   -0.015002627857029438,\n",
       "   0.011336473748087883,\n",
       "   0.00309575442224741,\n",
       "   0.004202425945550203,\n",
       "   -0.013163050636649132,\n",
       "   -0.02510404959321022,\n",
       "   0.021944917738437653,\n",
       "   0.0008031898178160191,\n",
       "   -0.011082964017987251,\n",
       "   0.012890039011836052,\n",
       "   -0.013975584879517555,\n",
       "   0.007663820404559374,\n",
       "   0.013702573254704475,\n",
       "   0.007566316518932581,\n",
       "   -0.002408350817859173,\n",
       "   0.025091050192713737,\n",
       "   -0.014092589728534222,\n",
       "   -0.021788911893963814,\n",
       "   0.022412937134504318,\n",
       "   0.0019078297773376107,\n",
       "   0.01320855226367712,\n",
       "   -0.007143798749893904,\n",
       "   -0.025949085131287575,\n",
       "   -0.016484688967466354,\n",
       "   -0.001954956678673625,\n",
       "   -0.028861207887530327,\n",
       "   0.012350516393780708,\n",
       "   -0.017108716070652008,\n",
       "   -0.0066530280746519566,\n",
       "   0.023166969418525696,\n",
       "   -0.016393685713410378,\n",
       "   0.013910582289099693,\n",
       "   0.006116755772382021,\n",
       "   -0.016497690230607986,\n",
       "   0.00023746305669192225,\n",
       "   0.014066588133573532,\n",
       "   -7.439764158334583e-05,\n",
       "   0.014768618158996105,\n",
       "   0.008456854149699211,\n",
       "   -0.028913209214806557,\n",
       "   0.012324515730142593,\n",
       "   -0.013936582952737808,\n",
       "   -0.015184635296463966,\n",
       "   0.006630277261137962,\n",
       "   2.045300425379537e-05,\n",
       "   -0.02893920987844467,\n",
       "   -0.017485732212662697,\n",
       "   -0.005990000441670418,\n",
       "   -0.03237135335803032,\n",
       "   -0.00960090197622776,\n",
       "   0.011602985672652721,\n",
       "   -0.021645905449986458,\n",
       "   0.018421771004796028,\n",
       "   -0.012344016693532467,\n",
       "   -0.012786034494638443,\n",
       "   0.002083337167277932,\n",
       "   -0.0071567995473742485,\n",
       "   -0.0138325784355402,\n",
       "   -0.004078920464962721,\n",
       "   0.010751449503004551,\n",
       "   0.002518855268135667,\n",
       "   0.027379145845770836,\n",
       "   0.017433729022741318,\n",
       "   0.03515347093343735,\n",
       "   0.012805535458028316,\n",
       "   -0.0181097574532032,\n",
       "   0.014157592318952084,\n",
       "   -0.0036271517165005207,\n",
       "   -0.0004412059497553855,\n",
       "   -0.004559940658509731,\n",
       "   -0.01848677359521389,\n",
       "   -0.017108716070652008,\n",
       "   -0.025390062481164932,\n",
       "   0.022984961047768593,\n",
       "   0.0376235730946064,\n",
       "   0.0380655936896801,\n",
       "   0.024519026279449463,\n",
       "   0.026547109708189964,\n",
       "   -0.006562024354934692,\n",
       "   0.011888997629284859,\n",
       "   -0.002406725659966469,\n",
       "   -0.003640152281150222,\n",
       "   -0.022516941651701927,\n",
       "   -0.0035003963857889175,\n",
       "   -0.01419659424573183,\n",
       "   0.008853370323777199,\n",
       "   0.0012927416246384382,\n",
       "   0.01705671288073063,\n",
       "   -0.014846621081233025,\n",
       "   0.007592317648231983,\n",
       "   -0.01574365794658661,\n",
       "   0.04937606677412987,\n",
       "   0.009932415559887886,\n",
       "   -0.00957490038126707,\n",
       "   0.00867136288434267,\n",
       "   -0.01756373420357704,\n",
       "   0.0056682368740439415,\n",
       "   -0.011147966608405113,\n",
       "   -0.015210635960102081,\n",
       "   0.02171090804040432,\n",
       "   0.004933706484735012,\n",
       "   -0.014222594909369946,\n",
       "   -0.002304346300661564,\n",
       "   0.013611569069325924,\n",
       "   -0.018005752936005592,\n",
       "   -0.002995000220835209,\n",
       "   -0.04014568030834198,\n",
       "   -0.002691112458705902,\n",
       "   -0.008359349332749844,\n",
       "   -0.0066887796856462955,\n",
       "   0.02133389189839363,\n",
       "   -0.011017960496246815,\n",
       "   0.0016535066533833742,\n",
       "   0.00034167052945122123,\n",
       "   -0.007826327346265316,\n",
       "   0.0421217605471611,\n",
       "   -3.206969995517284e-05,\n",
       "   0.006458020303398371,\n",
       "   0.022269930690526962,\n",
       "   0.03512746840715408,\n",
       "   -0.014339599758386612,\n",
       "   -0.0165236908942461,\n",
       "   0.012994043529033661,\n",
       "   0.01320855226367712,\n",
       "   0.015444645658135414,\n",
       "   -0.012675530277192593,\n",
       "   0.012994043529033661,\n",
       "   -0.014404602348804474,\n",
       "   -0.007104797288775444,\n",
       "   -0.010419935919344425,\n",
       "   0.025065047666430473,\n",
       "   0.0027902417350560427,\n",
       "   0.0017794494051486254,\n",
       "   0.01556165050715208,\n",
       "   -0.015951666980981827,\n",
       "   0.022724950686097145,\n",
       "   0.01782374642789364,\n",
       "   -0.0037831582594662905,\n",
       "   0.004423434846103191,\n",
       "   0.014417602680623531,\n",
       "   0.01679670251905918,\n",
       "   0.03473745286464691,\n",
       "   0.00811883993446827,\n",
       "   -0.0021743408869951963,\n",
       "   -0.01651069149374962,\n",
       "   0.005911997519433498,\n",
       "   0.02297196164727211,\n",
       "   -0.016419686377048492,\n",
       "   0.04048369452357292,\n",
       "   0.004280428867787123,\n",
       "   -0.018941791728138924,\n",
       "   -0.002951123518869281,\n",
       "   -0.002747989958152175,\n",
       "   -0.016328683122992516,\n",
       "   0.009945415891706944,\n",
       "   0.015730658546090126,\n",
       "   6.368235335685313e-05,\n",
       "   -0.002814617706462741,\n",
       "   -0.045085884630680084,\n",
       "   0.011524981819093227,\n",
       "   0.016978710889816284,\n",
       "   -0.00036442148848436773,\n",
       "   0.010627944953739643,\n",
       "   -0.035361479967832565,\n",
       "   0.01531464047729969,\n",
       "   0.004468936938792467,\n",
       "   0.034919459372758865,\n",
       "   -0.016666697338223457,\n",
       "   0.0031591320876032114,\n",
       "   0.01755073480308056,\n",
       "   0.005118964239954948,\n",
       "   0.005304221995174885,\n",
       "   -0.006162257865071297,\n",
       "   -0.0028649948071688414,\n",
       "   -0.014677613973617554,\n",
       "   0.006734281778335571,\n",
       "   -0.02815917693078518,\n",
       "   0.015548650175333023,\n",
       "   0.00021186823141761124,\n",
       "   -0.020930875092744827,\n",
       "   -0.02526005730032921,\n",
       "   0.0033281391952186823,\n",
       "   0.01558765210211277,\n",
       "   -0.0067277816124260426,\n",
       "   -0.02636510320007801,\n",
       "   -0.011498981155455112,\n",
       "   -0.0023449731525033712,\n",
       "   -0.007338806986808777,\n",
       "   -0.0185907781124115,\n",
       "   -0.018083756789565086,\n",
       "   -0.0006041190354153514,\n",
       "   0.0016429437091574073,\n",
       "   -0.01036793366074562,\n",
       "   -0.014040587469935417,\n",
       "   -0.00233197258785367,\n",
       "   0.03263136371970177,\n",
       "   0.003653152845799923,\n",
       "   -0.004218676593154669,\n",
       "   0.0009921039454638958,\n",
       "   -0.007865329273045063,\n",
       "   0.016224678605794907,\n",
       "   0.10712447762489319,\n",
       "   0.00043511195690371096,\n",
       "   0.00687728775665164,\n",
       "   -0.007072295993566513,\n",
       "   -0.014430603943765163,\n",
       "   -0.016939708963036537,\n",
       "   -0.02428501658141613,\n",
       "   -0.0030177512671798468,\n",
       "   0.03484145551919937,\n",
       "   -0.01019892655313015,\n",
       "   -0.012448020279407501,\n",
       "   -0.02247793972492218,\n",
       "   0.03866361826658249,\n",
       "   0.013169551268219948,\n",
       "   0.01088145561516285,\n",
       "   -0.00553498137742281,\n",
       "   -0.002726864069700241,\n",
       "   0.0020654613617807627,\n",
       "   0.0037831582594662905,\n",
       "   -0.029797246679663658,\n",
       "   -0.00902237743139267,\n",
       "   0.009594401344656944,\n",
       "   -0.0053757247515022755,\n",
       "   -0.0013951208675280213,\n",
       "   -0.012077504768967628,\n",
       "   -0.047009967267513275,\n",
       "   0.005099463276565075,\n",
       "   0.04373382776975632,\n",
       "   -0.0024847290478646755,\n",
       "   -0.035023465752601624,\n",
       "   -0.01151198148727417,\n",
       "   -0.017797743901610374,\n",
       "   -0.01591266505420208,\n",
       "   -0.0008434102637693286,\n",
       "   -0.008937873877584934,\n",
       "   0.0035751494579017162,\n",
       "   0.007254303433001041,\n",
       "   0.018993794918060303,\n",
       "   0.026131093502044678,\n",
       "   -0.0064287688583135605,\n",
       "   0.030863290652632713,\n",
       "   0.007111297454684973,\n",
       "   0.010517439804971218,\n",
       "   -0.0010798576986417174,\n",
       "   -0.0023368478287011385,\n",
       "   0.01137547567486763,\n",
       "   -0.006799284368753433,\n",
       "   0.02680712193250656,\n",
       "   -0.0021548401564359665,\n",
       "   -0.03627151623368263,\n",
       "   0.030655281618237495,\n",
       "   -0.004078920464962721,\n",
       "   -0.007007292937487364,\n",
       "   0.0019598319195210934,\n",
       "   0.020631862804293633,\n",
       "   -0.011654987931251526,\n",
       "   0.004875204060226679,\n",
       "   -0.01074494980275631,\n",
       "   -0.005138464737683535,\n",
       "   -0.006246761418879032,\n",
       "   -0.019266806542873383,\n",
       "   -0.017732741311192513,\n",
       "   -0.005434227176010609,\n",
       "   -0.007962833158671856,\n",
       "   -0.002806492382660508,\n",
       "   -0.04490387812256813,\n",
       "   -0.0030502525623887777,\n",
       "   0.00023075965873431414,\n",
       "   0.005440727807581425,\n",
       "   -0.024324016645550728,\n",
       "   0.004504688549786806,\n",
       "   -0.010692947544157505,\n",
       "   -0.018005752936005592,\n",
       "   -0.009516398422420025,\n",
       "   0.007540315389633179,\n",
       "   0.0018574526766315103,\n",
       "   0.010016919113695621,\n",
       "   -0.03887162730097771,\n",
       "   -0.0020963377319276333,\n",
       "   0.005255470052361488,\n",
       "   -0.017979752272367477,\n",
       "   -0.027587153017520905,\n",
       "   0.007299805525690317,\n",
       "   -0.03364540636539459,\n",
       "   0.007026793900877237,\n",
       "   -0.011056962423026562,\n",
       "   0.008216343820095062,\n",
       "   0.008339849300682545,\n",
       "   -0.018746783956885338,\n",
       "   0.008931373246014118,\n",
       "   0.0203978531062603,\n",
       "   0.01647168956696987,\n",
       "   0.009451394900679588,\n",
       "   -0.01952681690454483,\n",
       "   0.02520805411040783,\n",
       "   -0.012922540307044983,\n",
       "   -0.00328263733536005,\n",
       "   0.014651613309979439,\n",
       "   0.008677862584590912,\n",
       "   0.015886664390563965,\n",
       "   -0.015886664390563965,\n",
       "   -0.010848953388631344,\n",
       "   -0.014911623671650887,\n",
       "   0.0052749705500900745,\n",
       "   -0.0040009175427258015,\n",
       "   -0.0040756706148386,\n",
       "   -0.004069169983267784,\n",
       "   0.0009547274094074965,\n",
       "   -0.01550964917987585,\n",
       "   0.011017960496246815,\n",
       "   -0.02285495586693287,\n",
       "   -0.0078068263828754425,\n",
       "   -0.00014199031284078956,\n",
       "   -0.009126381948590279,\n",
       "   0.010166425257921219,\n",
       "   -0.004592441953718662,\n",
       "   -0.007319306023418903,\n",
       "   0.027431147173047066,\n",
       "   0.014365600422024727,\n",
       "   -0.011082964017987251,\n",
       "   -0.0022815954871475697,\n",
       "   -0.02160690352320671,\n",
       "   0.005499230232089758,\n",
       "   0.03569949418306351,\n",
       "   -0.017433729022741318,\n",
       "   0.006227260455489159,\n",
       "   0.00960090197622776,\n",
       "   -0.023153968155384064,\n",
       "   -0.012422019615769386,\n",
       "   0.0172257199883461,\n",
       "   -0.009945415891706944,\n",
       "   -0.01175899151712656,\n",
       "   -0.012389518320560455,\n",
       "   -0.0025838580913841724,\n",
       "   -0.03385341539978981,\n",
       "   -0.007455811835825443,\n",
       "   -0.015301640145480633,\n",
       "   -0.004013917874544859,\n",
       "   0.013117549009621143,\n",
       "   -0.026430105790495872,\n",
       "   -0.008411351591348648,\n",
       "   -0.011459979228675365,\n",
       "   -0.0008742865757085383,\n",
       "   -0.03697354719042778,\n",
       "   0.014755616895854473,\n",
       "   -0.025169052183628082,\n",
       "   -0.026053089648485184,\n",
       "   0.01843477040529251,\n",
       "   -0.008898871950805187,\n",
       "   0.0179277490824461,\n",
       "   -0.015353642404079437,\n",
       "   0.019552817568182945,\n",
       "   -0.034217432141304016,\n",
       "   0.01662769541144371,\n",
       "   0.018772784620523453,\n",
       "   -0.044539861381053925,\n",
       "   -0.01320855226367712,\n",
       "   0.004312930628657341,\n",
       "   0.00981541071087122,\n",
       "   0.014482606202363968,\n",
       "   0.040665701031684875,\n",
       "   -0.0029722494073212147,\n",
       "   0.016068672761321068,\n",
       "   -0.0063930172473192215,\n",
       "   0.004202425945550203,\n",
       "   -0.0005289596156217158,\n",
       "   0.015301640145480633,\n",
       "   0.000927913817577064,\n",
       "   -0.027691157534718513,\n",
       "   0.01744673028588295,\n",
       "   0.03161732107400894,\n",
       "   0.006844786461442709,\n",
       "   0.0228679571300745,\n",
       "   0.010562941431999207,\n",
       "   0.015730658546090126,\n",
       "   0.016328683122992516,\n",
       "   0.015197635628283024,\n",
       "   -0.011596485041081905,\n",
       "   -0.014820619486272335,\n",
       "   0.011531482450664043,\n",
       "   0.0035198971163481474,\n",
       "   -0.02345298044383526,\n",
       "   -0.004137422889471054,\n",
       "   -0.010738449171185493,\n",
       "   -0.020878873765468597,\n",
       "   -0.007371308282017708,\n",
       "   0.028263181447982788,\n",
       "   0.0061362567357718945,\n",
       "   -0.0023709742818027735,\n",
       "   -0.0072218021377921104,\n",
       "   0.02082687057554722,\n",
       "   -0.019175801426172256,\n",
       "   0.023426979780197144,\n",
       "   0.0016161301173269749,\n",
       "   0.008528356440365314,\n",
       "   -0.003053502645343542,\n",
       "   -0.009048378095030785,\n",
       "   0.014144591987133026,\n",
       "   0.011628986336290836,\n",
       "   7.840953185223043e-05,\n",
       "   0.005209967959672213,\n",
       "   0.02072286605834961,\n",
       "   -0.018343767151236534,\n",
       "   0.0067537822760641575,\n",
       "   0.0020215846598148346,\n",
       "   0.042953796684741974,\n",
       "   0.001074982457794249,\n",
       "   -0.01186299603432417,\n",
       "   0.015938667580485344,\n",
       "   -0.026001088321208954,\n",
       "   -0.02740514650940895,\n",
       "   -0.04386383295059204,\n",
       "   -0.01935780979692936,\n",
       "   -0.03827360272407532,\n",
       "   -0.029563236981630325,\n",
       "   -0.02121688798069954,\n",
       "   -0.014677613973617554,\n",
       "   0.00787832960486412,\n",
       "   -0.028861207887530327,\n",
       "   -0.031539320945739746,\n",
       "   0.0039976672269403934,\n",
       "   -0.012402518652379513,\n",
       "   0.032241348177194595,\n",
       "   0.01903279684484005,\n",
       "   0.015184635296463966,\n",
       "   0.030005255714058876,\n",
       "   -0.03910563513636589,\n",
       "   0.005060461815446615,\n",
       "   0.017537733539938927,\n",
       "   0.00043389314669184387,\n",
       "   -0.010036420077085495,\n",
       "   0.013975584879517555,\n",
       "   0.004709446802735329,\n",
       "   -2.537899126764387e-05,\n",
       "   0.00956840068101883,\n",
       "   0.0027171135880053043,\n",
       "   -0.018330765888094902,\n",
       "   -0.038039591163396835,\n",
       "   -0.04342181608080864,\n",
       "   -0.002985249971970916,\n",
       "   -0.008027835749089718,\n",
       "   0.0004769574443344027,\n",
       "   -0.04287579283118248,\n",
       "   -0.01241551898419857,\n",
       "   0.003009625943377614,\n",
       "   0.016367685049772263,\n",
       "   -0.029511233791708946,\n",
       "   -0.0068577867932617664,\n",
       "   -0.007078796159476042,\n",
       "   -0.03494546189904213,\n",
       "   -0.02121688798069954,\n",
       "   -0.0038384106010198593,\n",
       "   -0.0009977917652577162,\n",
       "   0.008346349000930786,\n",
       "   0.0061135059222579,\n",
       "   -0.01690070703625679,\n",
       "   0.0163026824593544,\n",
       "   -0.009691905230283737,\n",
       "   0.011342974379658699,\n",
       "   0.003744156565517187,\n",
       "   -0.0196958240121603,\n",
       "   0.02914721891283989,\n",
       "   -0.002535106148570776,\n",
       "   0.010458937846124172,\n",
       "   0.009340890683233738,\n",
       "   0.0021775909699499607,\n",
       "   0.006786284036934376,\n",
       "   -0.00011609079228946939,\n",
       "   0.017654739320278168,\n",
       "   0.026443105190992355,\n",
       "   0.001458498532883823,\n",
       "   0.008879370987415314,\n",
       "   -0.013026544824242592,\n",
       "   0.0118954973295331,\n",
       "   0.007026793900877237,\n",
       "   0.00597700010985136,\n",
       "   -0.009204384870827198,\n",
       "   -0.014690614305436611,\n",
       "   0.010575942695140839,\n",
       "   -0.010068921372294426,\n",
       "   0.017251722514629364,\n",
       "   0.009379892610013485,\n",
       "   -0.0014308723621070385,\n",
       "   -0.019058797508478165,\n",
       "   -0.009119881317019463,\n",
       "   0.004231676924973726,\n",
       "   -0.022737951949238777,\n",
       "   0.007761324755847454,\n",
       "   0.005473229102790356,\n",
       "   -0.000848285504616797,\n",
       "   -0.004283679183572531,\n",
       "   -0.0007101547089405358,\n",
       "   -0.006081004161387682,\n",
       "   0.01920180395245552,\n",
       "   0.0003268418076913804,\n",
       "   0.0046541946940124035,\n",
       "   0.017511732876300812,\n",
       "   0.02230893261730671,\n",
       "   -0.02259494550526142,\n",
       "   0.016328683122992516,\n",
       "   -0.019513815641403198,\n",
       "   0.015353642404079437,\n",
       "   -0.021177886053919792,\n",
       "   -0.00393916480243206,\n",
       "   0.017901748418807983,\n",
       "   -0.010621444322168827,\n",
       "   0.021086882799863815,\n",
       "   -0.02225693129003048,\n",
       "   -0.01914980076253414,\n",
       "   0.00414392352104187,\n",
       "   0.005096212960779667,\n",
       "   -0.006838285829871893,\n",
       "   -0.003753907047212124,\n",
       "   -0.0005342410877346992,\n",
       "   0.0017063213745132089,\n",
       "   0.01678370125591755,\n",
       "   -0.0015811910852789879,\n",
       "   -0.032241348177194595,\n",
       "   -0.01995583437383175,\n",
       "   0.008294346742331982,\n",
       "   0.009477396495640278,\n",
       "   -0.01238301768898964,\n",
       "   0.015535649843513966,\n",
       "   -0.0007621568511240184,\n",
       "   -0.0022360936272889376,\n",
       "   -0.029901251196861267,\n",
       "   0.01778474450111389,\n",
       "   -0.002580608008429408,\n",
       "   -0.012922540307044983,\n",
       "   0.0011968625476583838,\n",
       "   -0.014261596836149693,\n",
       "   0.002273470163345337,\n",
       "   -0.014222594909369946,\n",
       "   -0.020436855033040047,\n",
       "   -0.033281393349170685,\n",
       "   -0.0053789750672876835,\n",
       "   -0.005937998183071613,\n",
       "   0.021255889907479286,\n",
       "   0.0012358642416074872,\n",
       "   -0.0007731260848231614,\n",
       "   0.009893413633108139,\n",
       "   0.021736908704042435,\n",
       "   -0.00205733603797853,\n",
       "   0.021892916411161423,\n",
       "   0.0109919598326087,\n",
       "   -0.016757700592279434,\n",
       "   0.025910083204507828,\n",
       "   -0.03507546707987785,\n",
       "   -0.025728076696395874,\n",
       "   -0.018512774258852005,\n",
       "   -0.010939957574009895,\n",
       "   -0.0014121840940788388,\n",
       "   -0.0025074798613786697,\n",
       "   -0.028913209214806557,\n",
       "   -0.012669029645621777,\n",
       "   0.017368726432323456,\n",
       "   -0.021255889907479286,\n",
       "   0.003129880875349045,\n",
       "   -0.022126926109194756,\n",
       "   0.020254846662282944,\n",
       "   0.030369270592927933,\n",
       "   -0.01282503642141819,\n",
       "   0.005265220068395138,\n",
       "   0.020540859550237656,\n",
       "   -0.0031997589394450188,\n",
       "   0.02505204826593399,\n",
       "   0.0005825868574902415,\n",
       "   -0.007910830900073051,\n",
       "   -0.009113381616771221,\n",
       "   -0.007540315389633179,\n",
       "   0.008599859662353992,\n",
       "   0.02658611163496971,\n",
       "   -0.0031380061991512775,\n",
       "   -0.02630010060966015,\n",
       "   0.017199719324707985,\n",
       "   0.010172925889492035,\n",
       "   0.007065795361995697,\n",
       "   0.00198908313177526,\n",
       "   0.003968415781855583,\n",
       "   -0.027925167232751846,\n",
       "   -0.036557529121637344,\n",
       "   0.007897830568253994,\n",
       "   0.018070755526423454,\n",
       "   -0.0021743408869951963,\n",
       "   -0.0050182100385427475,\n",
       "   -0.017264721915125847,\n",
       "   -0.002024834742769599,\n",
       "   0.0021759660448879004,\n",
       "   0.00878186710178852,\n",
       "   -0.015028628520667553,\n",
       "   -0.020046837627887726,\n",
       "   -0.004270678851753473,\n",
       "   -0.006607526447623968,\n",
       "   -0.007904330268502235,\n",
       "   -0.01025742944329977,\n",
       "   -0.005781991872936487,\n",
       "   -0.00978940911591053,\n",
       "   -0.0068252854980528355,\n",
       "   0.01569165661931038,\n",
       "   -0.008196842856705189,\n",
       "   -0.0008100963896140456,\n",
       "   0.006981291808187962,\n",
       "   0.014846621081233025,\n",
       "   -0.0165236908942461,\n",
       "   -0.022620946168899536,\n",
       "   0.013676571659743786,\n",
       "   0.004156923852860928,\n",
       "   -0.0010896080639213324,\n",
       "   -0.02252994291484356,\n",
       "   -0.013494564220309258,\n",
       "   0.010218427516520023,\n",
       "   0.011693988926708698,\n",
       "   -0.0031038797460496426,\n",
       "   -0.019591819494962692,\n",
       "   0.004436435643583536,\n",
       "   -0.011050461791455746,\n",
       "   0.018083756789565086,\n",
       "   -0.036999545991420746,\n",
       "   0.03341139853000641,\n",
       "   0.016822703182697296,\n",
       "   -0.028289183974266052,\n",
       "   0.0027447398751974106,\n",
       "   -0.0037831582594662905,\n",
       "   -0.004166674334555864,\n",
       "   -0.017030712217092514,\n",
       "   -0.002385599771514535,\n",
       "   0.00030470025376416743,\n",
       "   -0.016887705773115158,\n",
       "   -0.022464940324425697,\n",
       "   -0.0178887490183115,\n",
       "   -0.011225969530642033,\n",
       "   -0.01957881823182106,\n",
       "   0.019825829192996025,\n",
       "   0.002070336602628231,\n",
       "   -0.005586983636021614,\n",
       "   0.02554606832563877,\n",
       "   0.2410820871591568,\n",
       "   -0.013351558707654476,\n",
       "   -0.003955415450036526,\n",
       "   0.02761315554380417,\n",
       "   -0.002915371907874942,\n",
       "   -0.0010692947544157505,\n",
       "   0.023270973935723305,\n",
       "   -0.0035914001055061817,\n",
       "   -0.03395742177963257,\n",
       "   -0.002749615116044879,\n",
       "   -0.005541482008993626,\n",
       "   0.015119632706046104,\n",
       "   0.004706196952611208,\n",
       "   0.007228302303701639,\n",
       "   -0.01705671288073063,\n",
       "   -0.014066588133573532,\n",
       "   -0.009418893605470657,\n",
       "   -0.003718155436217785,\n",
       "   -0.019539818167686462,\n",
       "   -0.023153968155384064,\n",
       "   0.03161732107400894,\n",
       "   -0.015015628188848495,\n",
       "   0.013189051300287247,\n",
       "   -0.03182533010840416,\n",
       "   0.025728076696395874,\n",
       "   -0.016926707699894905,\n",
       "   -0.014378601685166359,\n",
       "   -0.01251952350139618,\n",
       "   0.007403809577226639,\n",
       "   0.017082715407013893,\n",
       "   -0.010042919777333736,\n",
       "   -0.023973003029823303,\n",
       "   -0.0047029466368258,\n",
       "   -0.025390062481164932,\n",
       "   -0.018499772995710373,\n",
       "   -0.009282388724386692,\n",
       "   -0.018083756789565086,\n",
       "   -0.002736614551395178,\n",
       "   0.012584526091814041,\n",
       "   -0.0024294767063111067,\n",
       "   -0.003269636770710349,\n",
       "   0.001616942579858005,\n",
       "   0.007858828641474247,\n",
       "   -0.00032481044763699174,\n",
       "   0.01326705515384674,\n",
       "   0.014755616895854473,\n",
       "   ...]}]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = textwrap.dedent(\"\"\"\n",
    "MATCH (m:Movie {title: \"Toy Story\"})\n",
    "RETURN m.title AS title, m.plot AS plot, m.plotEmbedding\n",
    "\"\"\")\n",
    "\n",
    "result = execute_query(neo4j_driver, cypher)\n",
    "\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "deb7b3e8-f6ce-4b85-b978-802acc92e1f9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'m.title': 'Toy Story',\n",
       "  'm.plot': \"A cowboy doll is profoundly threatened and jealous when a new spaceman figure supplants him as top toy in a boy's room.\"},\n",
       " {'m.title': 'Jumanji',\n",
       "  'm.plot': 'When two kids find and play a magical board game, they release a man trapped for decades in it and a host of dangers that can only be stopped by finishing the game.'},\n",
       " {'m.title': 'Grumpier Old Men',\n",
       "  'm.plot': \"John and Max resolve to save their beloved bait shop from turning into an Italian restaurant, just as its new female owner catches Max's attention.\"},\n",
       " {'m.title': 'Waiting to Exhale',\n",
       "  'm.plot': \"Based on Terry McMillan's novel, this film follows four very different African-American women and their relationships with the male gender.\"},\n",
       " {'m.title': 'Father of the Bride Part II',\n",
       "  'm.plot': 'In this sequel, George Banks deals not only with the pregnancy of his daughter, but also with the unexpected pregnancy of his wife.'},\n",
       " {'m.title': 'Heat',\n",
       "  'm.plot': 'A group of professional bank robbers start to feel the heat from police when they unknowingly leave a clue at their latest heist.'},\n",
       " {'m.title': 'Sabrina',\n",
       "  'm.plot': 'An ugly duckling having undergone a remarkable change, still harbors feelings for her crush: a carefree playboy, but not before his business-focused brother has something to say about it.'},\n",
       " {'m.title': 'Tom and Huck',\n",
       "  'm.plot': \"Tom and Huck witness Injun Joe's killing of Doc Robinson one night at the graveyard. When an innocent man is accused of killing the Doc, Tom steps up as a witness, not respecting the promise made to Huck to lay low.\"},\n",
       " {'m.title': 'Sudden Death',\n",
       "  'm.plot': 'A former fireman takes on a group of terrorists holding the Vice President and others hostage during the seventh game of the NHL Stanley Cup finals.'},\n",
       " {'m.title': 'GoldenEye',\n",
       "  'm.plot': 'James Bond teams up with the lone survivor of a destroyed Russian research center to stop the hijacking of a nuclear space weapon by a fellow agent formerly believed to be dead.'},\n",
       " {'m.title': 'American President, The',\n",
       "  'm.plot': \"Comedy-drama about a widowed U.S. president and a lobbyist who fall in love. It's all above-board, but politics is perception and sparks fly anyway.\"},\n",
       " {'m.title': 'Dracula: Dead and Loving It',\n",
       "  'm.plot': \"Mel Brooks' parody of the classic vampire story and its famous film adaptations.\"},\n",
       " {'m.title': 'Balto',\n",
       "  'm.plot': 'An outcast half-wolf risks his life to prevent a deadly epidemic from ravaging Nome, Alaska.'},\n",
       " {'m.title': 'Nixon',\n",
       "  'm.plot': 'A biographical story of former U.S. president Richard Milhous Nixon, from his days as a young boy to his eventual presidency which ended in shame.'},\n",
       " {'m.title': 'Cutthroat Island',\n",
       "  'm.plot': 'A female pirate and her companion race against their rivals to find a hidden island that contains a fabulous treasure.'},\n",
       " {'m.title': 'Casino',\n",
       "  'm.plot': 'Greed, deception, money, power, and murder occur between two mobster best friends and a trophy wife over a gambling empire.'},\n",
       " {'m.title': 'Sense and Sensibility',\n",
       "  'm.plot': 'Rich Mr. Dashwood dies, leaving his second wife and her three daughters poor by the rules of inheritance. The two eldest daughters are the titular opposites.'},\n",
       " {'m.title': 'Four Rooms',\n",
       "  'm.plot': \"Four interlocking tales that take place in a fading hotel on New Year's Eve.\"},\n",
       " {'m.title': 'Ace Ventura: When Nature Calls',\n",
       "  'm.plot': 'Ace Ventura, Pet Detective, returns from a spiritual quest to investigate the disappearance of a rare white bat, the sacred animal of a tribe in Africa.'},\n",
       " {'m.title': 'Money Train',\n",
       "  'm.plot': 'A vengeful New York transit cop decides to steal a trainload of subway fares; his foster brother, a fellow cop, tries to protect him.'},\n",
       " {'m.title': 'Get Shorty',\n",
       "  'm.plot': 'A mobster travels to Hollywood to collect a debt and discovers that the movie business is much the same as his current job.'},\n",
       " {'m.title': 'Copycat',\n",
       "  'm.plot': 'An agoraphobic psychologist and a female detective must work together to take down a serial killer who copies serial killers from the past.'},\n",
       " {'m.title': 'Assassins',\n",
       "  'm.plot': \"Professional hit-man Robert Rath wants to fulfill a few more contracts before retiring but unscrupulous ambitious newcomer hit-man Miguel Bain keeps killing Rath's targets.\"},\n",
       " {'m.title': 'Powder',\n",
       "  'm.plot': 'A young bald albino boy with unique powers shakes up the rural community he lives in.'},\n",
       " {'m.title': 'Leaving Las Vegas',\n",
       "  'm.plot': 'Ben Sanderson, an alcoholic Hollywood screenwriter who lost everything because of his drinking, arrives in Las Vegas to drink himself to death. There, he meets and forms an uneasy friendship and non-interference pact with prostitute Sera.'},\n",
       " {'m.title': 'Othello',\n",
       "  'm.plot': 'The evil Iago pretends to be friend of Othello in order to manipulate him to serve his own end in the film version of this Shakespeare classic.'},\n",
       " {'m.title': 'Now and Then',\n",
       "  'm.plot': 'Four 12-year-old girls grow up together during an eventful small-town summer in 1970.'},\n",
       " {'m.title': 'Persuasion',\n",
       "  'm.plot': 'Eight years earlier, Anne Elliot, the daughter of a financially troubled aristocratic family, was persuaded to break off her engagement to Frederick Wentworth, a young seaman, who, though ...'},\n",
       " {'m.title': 'City of Lost Children, The (Cité des enfants perdus, La)',\n",
       "  'm.plot': 'A scientist in a surrealist society kidnaps children to steal their dreams, hoping that they slow his aging process.'},\n",
       " {'m.title': 'Shanghai Triad (Yao a yao yao dao waipo qiao)',\n",
       "  'm.plot': \"A provincial boy related to a Shanghai crime family is recruited by his uncle into cosmopolitan Shanghai in the 1930s to be a servant to a ganglord's mistress.\"},\n",
       " {'m.title': 'Dangerous Minds',\n",
       "  'm.plot': 'An ex-Marine turned teacher struggles to connect with her students in an inner city school.'},\n",
       " {'m.title': 'Twelve Monkeys (a.k.a. 12 Monkeys)',\n",
       "  'm.plot': 'In a future world devastated by disease, a convict is sent back in time to gather information about the man-made virus that wiped out most of the human population on the planet.'},\n",
       " {'m.title': 'Babe',\n",
       "  'm.plot': 'Babe, a pig raised by sheepdogs, learns to herd sheep with a little help from Farmer Hoggett.'},\n",
       " {'m.title': 'Carrington',\n",
       "  'm.plot': 'The platonic relationship between artist Dora Carrington and writer Lytton Strachey in the early 20th century.'},\n",
       " {'m.title': 'Dead Man Walking',\n",
       "  'm.plot': \"A nun, while comforting a convicted killer on death row, empathizes with both the killer and his victim's families.\"},\n",
       " {'m.title': 'Across the Sea of Time',\n",
       "  'm.plot': 'A young Russian boy, Thomas Minton, travels to New York as a passenger on a Russian freighter. Close to Ellis Island he gets off and thus starts his journey to America the same way as all ...'},\n",
       " {'m.title': 'It Takes Two',\n",
       "  'm.plot': \"Alyssa (a rich girl) and Amanda (an orphan) are two little girls who are identical, but complete strangers, that accidentally meet one day. In an attempt to stop Alyssa's father from ...\"},\n",
       " {'m.title': 'Clueless',\n",
       "  'm.plot': \"A rich high school student tries to boost a new pupil's popularity, but reckons without affairs of the heart getting in the way.\"},\n",
       " {'m.title': 'Cry, the Beloved Country',\n",
       "  'm.plot': 'A South-African preacher goes to search for his wayward son who has committed a crime in the big city.'},\n",
       " {'m.title': 'Richard III',\n",
       "  'm.plot': 'The classic Shakespearean play about a murderously scheming king staged in an alternative fascist England setting.'},\n",
       " {'m.title': 'Dead Presidents',\n",
       "  'm.plot': 'A Vietnam vet adjusts to life after the war while trying to support his family, but the chance of a better life may involve crime and bloodshed.'},\n",
       " {'m.title': 'Restoration',\n",
       "  'm.plot': 'The exiled royal physician to King Charles II devotes himself to helping Londoners suffering from the plague, and in the process falls in love with an equally poor woman.'},\n",
       " {'m.title': 'Mortal Kombat',\n",
       "  'm.plot': 'Three unknowing martial artists are summoned to a mysterious island to compete in a tournament whose outcome will decide the fate of the world.'},\n",
       " {'m.title': 'To Die For',\n",
       "  'm.plot': 'Suzanne Stone is an aspiring TV personality who will do anything to be in the spotlight, including enlisting three teenagers to kill her husband.'},\n",
       " {'m.title': 'How to Make an American Quilt',\n",
       "  'm.plot': 'Bride-to-be Finn Dodd hears tales of romance and sorrow from her elders as they construct a quilt.'},\n",
       " {'m.title': 'Seven (a.k.a. Se7en)',\n",
       "  'm.plot': 'Two detectives, a rookie and a veteran, hunt a serial killer who uses the seven deadly sins as his modus operandi.'},\n",
       " {'m.title': 'Pocahontas',\n",
       "  'm.plot': 'An English soldier and the daughter of an Algonquin chief share a romance when English colonists invade seventeenth-century Virginia.'},\n",
       " {'m.title': 'When Night Is Falling',\n",
       "  'm.plot': 'An uptight and conservative woman, working on tenure as a literacy professor at a large urban university, finds herself strangely attracted to a free-spirited, liberal woman who works at a local carnival that comes to town.'},\n",
       " {'m.title': 'Usual Suspects, The',\n",
       "  'm.plot': 'A sole survivor tells of the twisty events leading up to a horrific gun battle on a boat, which begin when five criminals meet at a seemingly random police lineup.'},\n",
       " {'m.title': 'Mighty Aphrodite',\n",
       "  'm.plot': \"When he discovers his adopted son is a genius, a New York sportswriter seeks out the boy's birth mother: a prostitute.\"},\n",
       " {'m.title': 'Lamerica',\n",
       "  'm.plot': 'Two Italian racketeers come to Albania just after the fall of the communists to set up a fictive firm and pocket the grants. They need a stooge. They choose an old one in a jail : Spiro. ...'},\n",
       " {'m.title': 'Big Green, The',\n",
       "  'm.plot': 'Another Disney underdog sports team of misfit kids (soccer this time) learns to play a new sport and become champions, while building self-esteem, making friends and solving a variety of ...'},\n",
       " {'m.title': 'Georgia',\n",
       "  'm.plot': 'Sadie is desperately looking up to her older sister Georgia who is a famous C&W artist. Sadie wants to be a famous artist like her sister, but is always doing everything wrong. Her ...'},\n",
       " {'m.title': 'Home for the Holidays',\n",
       "  'm.plot': 'After losing her job, making out with her soon-to-be former boss and finding out that her daughter plans to spend Thanksgiving with her boyfriend, Claudia Larson faces spending the holiday with her family.'},\n",
       " {'m.title': 'Postman, The (Postino, Il)',\n",
       "  'm.plot': 'Simple Italian postman learns to love poetry while delivering mail to a famous poet; he uses this to woo local beauty Beatrice.'},\n",
       " {'m.title': 'Confessional, The (Confessionnal, Le)',\n",
       "  'm.plot': 'The year is 1952, in Quebec City. Rachel, 16, unmarried, and pregnant, works in the church. Filled with shame, she unburdens her guilt to a young priest, under the confidentiality of the ...'},\n",
       " {'m.title': 'Indian in the Cupboard, The',\n",
       "  'm.plot': 'On his ninth birthday a boy receives many presents. Two of them first seem to be less important: an old cupboard from his brother and a little Indian figure made of plastic from his best ...'},\n",
       " {'m.title': 'Eye for an Eye',\n",
       "  'm.plot': 'When the courts fail to keep behind bars the man who raped and murdered her daughter, a woman seeks her own form of justice.'},\n",
       " {'m.title': \"Mr. Holland's Opus\",\n",
       "  'm.plot': 'A frustrated composer finds fulfillment as a high school music teacher.'},\n",
       " {'m.title': \"Don't Be a Menace to South Central While Drinking Your Juice in the Hood\",\n",
       "  'm.plot': \"Don't Be a Menace to South Central While Drinking your Juice in the Hood is a parody of several U.S. films about being in the 'Hood', for instance Boyz n the Hood, South Central, ...\"},\n",
       " {'m.title': 'Two if by Sea',\n",
       "  'm.plot': \"Frank O'Brien, a petty thief, and his 7-year-long girlfriend Roz want to put an end to their unsteady lifestyle and just do that _last_ job, which involves stealing a valuable painting. ...\"},\n",
       " {'m.title': 'Bio-Dome',\n",
       "  'm.plot': 'Moronic best friends get themselves locked inside the Bio-Dome, a science experiment, along with a group of environmental scientists for one year.'},\n",
       " {'m.title': 'Lawnmower Man 2: Beyond Cyberspace',\n",
       "  'm.plot': 'Jobe is resuscitated by Jonathan Walker. He wants Jobe to create a special computer chip that would connect all the computers in the world into one network, which Walker would control and ...'},\n",
       " {'m.title': 'French Twist (Gazon maudit)',\n",
       "  'm.plot': \"After learning of her husband's infidelities, a housewife invites an itinerant lesbian to move in with them. None of their lives will ever be the same again.\"},\n",
       " {'m.title': 'Friday',\n",
       "  'm.plot': \"Two homies, Smokey and Craig, smoke a dope dealer's weed and try to figure a way to get the $200 they owe to the dealer by ten p.m. that same night. In that time, they smoke more weed, get jacked, and they get shot at in a drive-by.\"},\n",
       " {'m.title': 'From Dusk Till Dawn',\n",
       "  'm.plot': 'Two criminals and their hostages unknowingly seek temporary refuge in an establishment populated by vampires, with chaotic results.'},\n",
       " {'m.title': 'Fair Game',\n",
       "  'm.plot': 'Max Kirkpatrick is a cop who protects Kate McQuean, a civil law attorney, from a renegade KGB team out to terminate her.'},\n",
       " {'m.title': 'Kicking and Screaming',\n",
       "  'm.plot': 'Following graduation, a handful of college students do nothing and talk about it wittily.'},\n",
       " {'m.title': 'Misérables, Les',\n",
       "  'm.plot': \"Henri Fortin is poor and iliterate former boxer. Ziman is rich Jewish lawyer from Paris. During WWII they meet when Fortin agrees to drive Ziman's family to Switzerland. Intrigued by Victor...\"},\n",
       " {'m.title': 'Bed of Roses',\n",
       "  'm.plot': 'Romantic drama about a young career girl who is swept off her feet by a shy florist, who fell in love with her after one glimpse through a shadowy window.'},\n",
       " {'m.title': 'Screamers',\n",
       "  'm.plot': '(SIRIUS 6B, Year 2078) On a distant mining planet ravaged by a decade of war, scientists have created the perfect weapon: a blade-wielding, self-replicating race of killing devices known as...'},\n",
       " {'m.title': 'Nico Icon',\n",
       "  'm.plot': 'A look into the many lives of Christa Päffgen, otherwise known as Nico; from cutie German mädchen to the first of the supermodels, to glamorous diva of the Velvet Underground, to cult item,...'},\n",
       " {'m.title': 'Crossing Guard, The',\n",
       "  'm.plot': 'Freddie Gale is a seedy jeweler who has sworn to kill the drunk driver who killed his little girl.'},\n",
       " {'m.title': 'Juror, The',\n",
       "  'm.plot': 'When Annie Laird is selected as a juror in a big Mafia trial, she is forced by someone known as The Teacher to persuade the other jurors to vote not guilty. He threatens to kill her son...'},\n",
       " {'m.title': 'White Balloon, The (Badkonake sefid)',\n",
       "  'm.plot': \"Several people try to take advantage of a little girl's innocence to hustle money her mom gave to her to buy a goldfish with.\"},\n",
       " {'m.title': \"Things to Do in Denver When You're Dead\",\n",
       "  'm.plot': 'Five different criminals face imminent death after botching a job quite badly.'},\n",
       " {'m.title': \"Antonia's Line (Antonia)\",\n",
       "  'm.plot': 'A Dutch matron establishes and, for several generations, oversees a close-knit, matriarchal community where feminism and liberalism thrive.'},\n",
       " {'m.title': 'Once Upon a Time... When We Were Colored',\n",
       "  'm.plot': 'A narrator tells the story of his childhood years in a tightly knit Afro-American community in the deep south under racial segregation.'},\n",
       " {'m.title': 'Last Summer in the Hamptons',\n",
       "  'm.plot': 'Filmed entirely on location in East Hampton, Long Island, Last Summer in the Hamptons concerns a large theatrical family spending the last weekend of their summer together at the ...'},\n",
       " {'m.title': 'Angels and Insects',\n",
       "  'm.plot': 'In the 1800s a naturalist marries into a family of British country gentry.'},\n",
       " {'m.title': 'White Squall',\n",
       "  'm.plot': 'Teenage boys discover discipline and camaraderie on an ill-fated sailing voyage.'},\n",
       " {'m.title': 'Dunston Checks In',\n",
       "  'm.plot': 'Young boy befriends larcenous orangutan in luxury hotel.'},\n",
       " {'m.title': 'Black Sheep',\n",
       "  'm.plot': \"A gubernatorial candidate hires a wormy special assistant whose only job is to make sure the candidate's well-meaning but incompetent brother doesn't ruin the election.\"},\n",
       " {'m.title': 'Nick of Time',\n",
       "  'm.plot': 'An unimpressive, every-day man is forced into a situation where he is told to kill a politician to save his kidnapped daughter.'},\n",
       " {'m.title': 'Mary Reilly',\n",
       "  'm.plot': 'A housemaid falls in love with Dr. Jekyll and his darkly mysterious counterpart, Mr. Hyde.'},\n",
       " {'m.title': 'Vampire in Brooklyn',\n",
       "  'm.plot': 'Maximillian is the only survivor from a race of vampires on a Caribbean Island, and as a vampire, he must find a mate to keep the line from ending. He knows that a child had been born to a ...'},\n",
       " {'m.title': 'Beautiful Girls',\n",
       "  'm.plot': 'A piano player at a crossroads in his life returns home to his friends and their own problems with life and love.'},\n",
       " {'m.title': 'Broken Arrow',\n",
       "  'm.plot': \"Terrorists steal nuclear warheads from the U.S. military but don't count on a pilot and park ranger spoiling their plans.\"},\n",
       " {'m.title': 'In the Bleak Midwinter',\n",
       "  'm.plot': \"Out of work actor Joe volunteers to help try and save his sister's local church for the community by putting on a Christmas production of Hamlet, somewhat against the advice of his agent ...\"},\n",
       " {'m.title': 'Hate (Haine, La)',\n",
       "  'm.plot': '24 hours in the lives of three young men in the French suburbs the day after a violent riot.'},\n",
       " {'m.title': 'Shopping',\n",
       "  'm.plot': \"You've run out of options, no school, no job. Steal a car, smash a shop with a heavy car and reap the proceeds!. This movie is about underground England. The causes, the benefits, and the result of a life of 'crash and carry'.\"},\n",
       " {'m.title': 'Heidi Fleiss: Hollywood Madam',\n",
       "  'm.plot': 'A documentary crew from the BBC arrives in L.A. intent on interviewing Heidi Fleiss, a year after her arrest for running a brothel but before her trial. Several months elapse before the ...'},\n",
       " {'m.title': 'City Hall',\n",
       "  'm.plot': 'The accidental shooting of a boy in New York leads to an investigation by the Deputy Mayor, and unexpectedly far-reaching consequences.'}]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = textwrap.dedent(\"\"\"\n",
    "MATCH (m:Movie)\n",
    "WHERE m.plotEmbedding IS NOT NULL\n",
    "RETURN m.title, m.plot\n",
    "\"\"\")\n",
    "\n",
    "result = execute_query(neo4j_driver, cypher)\n",
    "\n",
    "result"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b618681c-b5e3-4612-b329-8f345c2f6809",
   "metadata": {},
   "source": [
    "## Querying Vector Indexes\n",
    "\n",
    "You can query the moviePlots index using the [db.index.vector.queryNodes()](https://neo4j.com/docs/cypher-manual/current/indexes/semantic-indexes/vector-indexes/?_gl=1*1ne1ez8*_ga*MTkzMzgxNTk1LjE3NTcyNTg0MzQ.*_ga_DZP8Z65KK4*czE3NjMxODcxMDUkbzQ1JGcxJHQxNzYzMTg3NDE4JGoyNiRsMCRoMA..*_gcl_au*MjEzNTI4NjkxNy4xNzU3MjU4NDMzLjc4MDQ1OTczLjE3NTg0MTY3NjUuMTc1ODQxNjc2NA..*_ga_DL38Q8KGQC*czE3NjMxODcxMDUkbzQ1JGcxJHQxNzYzMTg3NDE4JGoyNiRsMCRoMA..#query-vector-index) procedure.\n",
    "\n",
    "The procedure returns the requested number of approximate nearest neighbor nodes and their similarity score, ordered by the score.\n",
    "\n",
    "```cypher\n",
    "CALL db.index.vector.queryNodes(\n",
    "    indexName :: STRING,\n",
    "    numberOfNearestNeighbours :: INTEGER,\n",
    "    query :: LIST<FLOAT>\n",
    ") YIELD node, score\n",
    "```\n",
    "\n",
    "\n",
    "The procedure accepts three parameters:\n",
    "\n",
    "1. indexName - The name of the vector index\n",
    "\n",
    "2. numberOfNearestNeighbours - The number of results to return\n",
    "\n",
    "3. query - A list of floats that represent an embedding\n",
    "\n",
    "The procedure yields two arguments:\n",
    "\n",
    "4. A node which matches the query\n",
    "\n",
    "5. A similarity score ranging from 0.0 to 1.0.\n",
    "\n",
    "You can use this procedure to find the closest embedding value to a given value.\n",
    "\n",
    "## Querying Similar Movie Plots\n",
    "\n",
    "You can use the moviePlots vector index to find movies with similar plots.\n",
    "\n",
    "Review this Cypher before running it.\n",
    "\n",
    "```cypher\n",
    "MATCH (m:Movie {title: 'Toy Story'})\n",
    "\n",
    "CALL db.index.vector.queryNodes('moviePlots', 6, m.plotEmbedding)\n",
    "YIELD node, score\n",
    "\n",
    "RETURN node.title AS title, node.plot AS plot, score\n",
    "```\n",
    "\n",
    "The query finds the Toy Story Movie node and uses the .plotEmbedding property to find the most similar plots.\n",
    "\n",
    "The `db.index.vector.queryNodes()` procedure uses the moviePlots vector index to find similar embeddings.\n",
    "\n",
    "Run the query. The procedure returns the requested number of nodes and their similarity score, ordered by the score."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "6dabaf32-8f48-4d26-94dc-5bc01bc995f7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'title': 'Toy Story',\n",
       "  'plot': \"A cowboy doll is profoundly threatened and jealous when a new spaceman figure supplants him as top toy in a boy's room.\",\n",
       "  'score': 1.0},\n",
       " {'title': 'Indian in the Cupboard, The',\n",
       "  'plot': 'On his ninth birthday a boy receives many presents. Two of them first seem to be less important: an old cupboard from his brother and a little Indian figure made of plastic from his best ...',\n",
       "  'score': 0.9169706106185913},\n",
       " {'title': 'Powder',\n",
       "  'plot': 'A young bald albino boy with unique powers shakes up the rural community he lives in.',\n",
       "  'score': 0.9130690097808838},\n",
       " {'title': 'Jumanji',\n",
       "  'plot': 'When two kids find and play a magical board game, they release a man trapped for decades in it and a host of dangers that can only be stopped by finishing the game.',\n",
       "  'score': 0.9099509716033936},\n",
       " {'title': 'Babe',\n",
       "  'plot': 'Babe, a pig raised by sheepdogs, learns to herd sheep with a little help from Farmer Hoggett.',\n",
       "  'score': 0.9046024084091187},\n",
       " {'title': 'Get Shorty',\n",
       "  'plot': 'A mobster travels to Hollywood to collect a debt and discovers that the movie business is much the same as his current job.',\n",
       "  'score': 0.9020365476608276}]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = textwrap.dedent(\"\"\"\n",
    "MATCH (m:Movie {title: 'Toy Story'})\n",
    "\n",
    "CALL db.index.vector.queryNodes('moviePlots', 6, m.plotEmbedding)\n",
    "YIELD node, score\n",
    "\n",
    "RETURN node.title AS title, node.plot AS plot, score\n",
    "\"\"\")\n",
    "\n",
    "result = execute_query(neo4j_driver, cypher)\n",
    "\n",
    "result"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c169bdc9-2d1e-43c5-a8e7-e690f8661501",
   "metadata": {},
   "source": [
    "## Generate Embeddings\n",
    "\n",
    "You can generate a new embedding in Cypher using the [genai.vector.encode](https://neo4j.com/docs/cypher-manual/current/genai-integrations/?_gl=1*1mimogn*_ga*MTkzMzgxNTk1LjE3NTcyNTg0MzQ.*_ga_DZP8Z65KK4*czE3NjMxODcxMDUkbzQ1JGcxJHQxNzYzMTg3NDE4JGoyNiRsMCRoMA..*_gcl_au*MjEzNTI4NjkxNy4xNzU3MjU4NDMzLjc4MDQ1OTczLjE3NTg0MTY3NjUuMTc1ODQxNjc2NA..*_ga_DL38Q8KGQC*czE3NjMxODcxMDUkbzQ1JGcxJHQxNzYzMTg3NDE4JGoyNiRsMCRoMA..#single-embedding) function:\n",
    "\n",
    "```cypher\n",
    "WITH genai.vector.encode(\n",
    "    \"Text to create embeddings for\",\n",
    "    \"OpenAI\",\n",
    "    { token: \"sk-...\" }) AS embedding\n",
    "RETURN embedding\n",
    "```\n",
    "\n",
    "## Generate a Plot Embedding\n",
    "\n",
    "You can use the embedding to query the vector index to find similar movies.\n",
    "\n",
    "This query, creates and embedding for the text \"A mysterious spaceship lands Earth\" and uses it to query the moviePlots vector index for the 6 most similar movie plots.\n",
    "\n",
    "```cypher\n",
    "WITH genai.vector.encode(\n",
    "    \"A mysterious spaceship lands Earth\",\n",
    "    \"OpenAI\",\n",
    "    { token: \"sk-...\" }) AS myMoviePlot\n",
    "CALL db.index.vector.queryNodes('moviePlots', 6, myMoviePlot)\n",
    "YIELD node, score\n",
    "RETURN node.title, node.plot, score\n",
    "```\n",
    "\n",
    "## Considerations\n",
    "\n",
    "Using embeddings and vectors is relatively straightforward and can quickly yield results. The downside to this approach is that it relies heavily on the embeddings and similarity function to produce valid results.\n",
    "\n",
    "This approach is also a black box. There are 1536 dimensions; it would be impossible to determine how the vectors are structured and how they influenced the similarity score.\n",
    "\n",
    "The movies returned look similar, but without reading and comparing them, you would have no way of verifying that the results are correct.\n",
    "\n",
    "Vectors work well for:\n",
    "\n",
    "- Contextual or Meaning Based Questions\n",
    "\n",
    "- Fuzzy or Vague queries\n",
    "\n",
    "- Broad or Open-Ended questions\n",
    "\n",
    "- Complex queries with multiple concepts\n",
    "\n",
    "Vectors are ineffective for:\n",
    "\n",
    "- Highly Specific or Fact-Based Questions\n",
    "\n",
    "- Numerical or Exact-Match Queries\n",
    "\n",
    "- Boolean or Logical Queries\n",
    "\n",
    "- Ambiguous or Unclear Queries without Context\n",
    "\n",
    "- Specialized Knowledge\n",
    "\n",
    "In the next lesson you will look at how you can improve the results by using a combination of vector and graph queries."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "97adc537-b482-401c-8526-b5b53026d993",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6b8dc461-68c1-4497-b951-0eef2ab56e33",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
